import 'package:omdat_alhadeth/models/hadeth_model.dart';

class Constants {
  static final List<Book> books = [
    //book 1 كتاب الطهارة
    Book(
      bookName: 'كتاب الطهارة',
      doors: [
        Door(
          doorName: 'باب الاستطابة',
          hadeths: [
            Hadeth(
              hadethText:
                  "\u202Bعن عمرَ بنِ الخطابِ رضي الله عنه قال: سمعتُ رسولَ الله ﷺ يقول: «إنما الأعمالُ بالنيَّاتِ – وفي روايةٍ: بالنيَّةِ – وإنما لكلِّ امرئٍ ما نوى. فمَن كانت هجرتُه إلى الله ورسولِه؛ فهجرتُه إلى الله ورسولِه. ومَن كانت هجرتُه إلى دنيا يُصيبُها أو امرأةٍ يتزوَّجُها؛ فهجرتُه إلى ما هاجرَ إليه».\u202C",
              hadethNumber: 1,
              soundUrl: 'assets/sounds/1.ogg',
              explainUrl: 'https://youtu.be/UecgSkzVn-M?si=_gUV1i1o8N8LYP0V',
            ),
            Hadeth(
              hadethText:
                  "\u202Bعن أبي هريرةَ رضيَ اللهُ عنه قال: قال رسولُ اللهِ ﷺ: «لا يَقبَلُ اللهُ صلاةَ أحدِكم إذا أَحدَثَ حتى يَتوضَّأَ». متفقٌ عليه.\u202C",
              hadethNumber: 2,
              soundUrl: 'assets/sounds/2.ogg',
              explainUrl: 'https://youtu.be/IBrOhe6qJB8?si=_buSz7w8iMUFMr_K',
            ),
            Hadeth(
              hadethText:
                  "\u202Bعن عبدِ اللهِ بنِ عمرو بنِ العاصِ، وأبي هُرَيرةَ، وعائشةَ رضيَ اللهُ عنهم قالوا: قال رسولُ اللهِ ﷺ: «وَيْلٌ لِلأَعْقابِ مِنَ النَّارِ».\u202C",
              hadethNumber: 3,
              soundUrl: 'assets/sounds/3.ogg',
              explainUrl: 'https://youtu.be/PMkA3Z9tp90?si=RFteksH7lPV_unvm',
            ),
            Hadeth(
              hadethText:
                  "\u202Bعن أبي هريرةَ رضيَ اللهُ عنه أنَّ رسولَ اللهِ ﷺ قال:\n«إذا توضَّأ أحدُكم فليجعلْ في أنفِه ماءً ثم لينتثِرْ. ومنِ استجمرَ فليوترْ. وإذا استيقظَ أحدُكم من نومِه فليغسِلْ يدَيْهِ قبلَ أن يُدخِلَهُما في الإناءِ ثلاثًا، فإنَّ أحدَكم لا يدري أين باتت يدُه».\nوفي لفظٍ لمسلم: «فليستنشقْ بمنخريهِ من الماء».\nوفي لفظٍ: «من توضأ فليستنشق».\u202C",

              hadethNumber: 4,
              soundUrl: 'assets/sounds/4.ogg',
              explainUrl: 'https://youtu.be/9Md9J2EZjco?si=Ulg5oynXsDh7bGdE',
            ),
            Hadeth(
              hadethText:
                  "\u202Bعن أبي هريرةَ رضيَ اللهُ عنه أنَّ رسولَ اللهِ ﷺ قال:\n«لا يَبولنَّ أحدُكم في الماءِ الدائمِ الذي لا يَجري، ثم يغتسلُ فيه».\nوفي روايةٍ لمسلم: «لا يغتسلُ أحدُكم في الماءِ الدائم وهو جُنُب».\nوهو صحيح.\u202C",
              hadethNumber: 5,
              soundUrl: 'assets/sounds/5.ogg',
              explainUrl: 'https://youtu.be/6Pb3Z7Cc9Bo?si=CTn4TmyYnyZQyW82',
            ),
            Hadeth(
              hadethText:
                  "\u202Bعن أبي هريرةَ رضيَ اللهُ عنه أنَّ رسولَ اللهِ ﷺ قال:\n"
                  "\u2067\u00ABإذا شَرِبَ الكلبُ في إناءِ أحدِكم فليغسِلْهُ سبعًا\u00BB\u2069.\n"
                  "ولمسلم: \u2067\u00ABأولاهنَّ بالتراب\u00BB\u2069.\n"
                  "وفي حديثِ عبدِ اللهِ بنِ مُغفَّلٍ المُزَنيِّ قال: قال رسولُ اللهِ ﷺ:\n"
                  "\u2067\u00ABإذا ولغَ الكلبُ في الإناء فاغسلوهُ سبعًا، وعَفِّروهُ الثامنةَ بالتراب\u00BB\u2069.\u202C",
              hadethNumber: 6,
              soundUrl: "assets/sounds/6.ogg",
              explainUrl: "https://youtu.be/56KwB_Almwc?si=NaztyLZ6BSBSFQge",
            ),
            Hadeth(
              hadethText:
                  "\u202Bعن حُمرانَ مولى عُثمانَ بنِ عفّانَ رضيَ اللهُ عنه: أنَّه رأى عُثمانَ دعا بوُضوءٍ، فأفرغ على يديه من إنائه فغسلهما ثلاثَ مرّات.\n"
                  "ثم أدخل يمينَه في الوُضوء، ثم تمضمضَ واستنشقَ واستنثرَ.\n"
                  "ثم غسلَ وجهَه ثلاثًا، ويدَيْهِ إلى المِرفقين ثلاثًا.\n"
                  "ثم مسحَ برأسِه، ثم غسلَ رجلَيْهِ ثلاثًا.\n"
                  "ثم قال: رأيتُ النبيَّ ﷺ يتوضّأ نحوَ وُضوئي هذا.\n"
                  "وقال: \u2067\u00ABمن توضّأ نحوَ وُضوئي هذا، ثم صلّى ركعتين لا يُحدِّثُ فيهما نفسَه؛ غُفِر له ما تقدَّمَ من ذنبِه\u00BB\u2069.\u202C",
              hadethNumber: 7,
              soundUrl: 'assets/sounds/7.ogg',
              explainUrl: 'https://youtu.be/VJ59ZV2Xb2w?si=JjnBbnP6qzdk9srj',
            ),
            Hadeth(
              hadethText:
                  "\u202Bعن عمروِ بنِ يَحيى المازِنيِّ، عن أبيه قال: \u2067\u00ABشَهِدتُ عمروَ بنَ أبي حَسَنٍ سأل عبدَ اللهِ بنَ زيدٍ رضيَ اللهُ عنه عن وُضوءِ النبيِّ ﷺ، فدَعا بتَوْرٍ من ماءٍ، فتوضّأ لهم وُضوءَ النبيِّ ﷺ\u00BB\u2069.\n"
                  "فأكفأ على يديه من التَّوْرِ فغَسَلَهما ثلاثًا.\n"
                  "ثم أدخل يمينَه في التَّوْرِ فتمضمضَ واستنشقَ واستنثرَ ثلاثًا ثلاثَ غَرَفاتٍ.\n"
                  "ثم أدخل يدَه فغسل وجهَه.\n"
                  "ثم أدخل يدَه فغسل يدَيْهِ إلى المِرفقَيْن مرتينِ مرتينِ.\n"
                  "ثم أدخل يدَه فمسح رأسَه فأقبلَ بهما وأدبرَ مرّةً واحدةً.\n"
                  "ثم غسل رِجلَيْهِ.\n"
                  "وفي روايةٍ: \u2067\u00ABبدأ بمُقدَّمِ رأسِه حتى ذهبَ بهما إلى قفاه، ثم رَدَّهما حتى رجع إلى المكانِ الذي بدأ منه\u00BB\u2069.\n"
                  "وفي روايةٍ: \u2067\u00ABأتانا رسولُ اللهِ ﷺ فأخرجْنا له ماءً في تَوْرٍ من صُفْرٍ\u00BB\u2069.\u202C",
              hadethNumber: 8,
              soundUrl: 'assets/sounds/8.ogg',
              explainUrl: 'https://youtu.be/YaFHBq39kYM?si=es0iS2QCRscA9r6g',
            ),
            Hadeth(
              hadethText:
                  "\u202Bعن عائشةَ رضيَ اللهُ عنها قالت:\n"
                  "\u2067\u00ABكان النبيُّ ﷺ يُعجِبُه التَّيَمُّنُ في تَنَعُّلِهِ وتَرَجُّلِهِ وطُهورِهِ، وفي شأنِهِ كلِّهِ\u00BB\u2069.\u202C",
              hadethNumber: 9,
              soundUrl: 'assets/sounds/9.ogg',
              explainUrl: 'https://youtu.be/9hQv55pjFF8?si=56TJe4xNmqFj00vH',
            ),

            Hadeth(
              hadethText:
                  "\u202Bعن أبي هريرةَ رضيَ اللهُ عنه، عن النبيِّ ﷺ أنَّه قال:\n"
                  "\u2067\u00ABإنَّ أُمَّتي يأتونَ يومَ القيامةِ غُرًّا مُحَجَّلِينَ من آثارِ الوضوءِ، فمَنِ استطاعَ منكم أنْ يُطيلَ غُرَّتَهُ فليفعَل\u00BB\u2069.\n"
                  "وفي روايةٍ: عن نُعيمِ بنِ عبدِ اللهِ المُجْمِّرِ، عن أبي هريرةَ رضيَ اللهُ عنه، عن النبيِّ ﷺ مثلَه.\n"
                  "ثم قال: رأيتُ أبا هريرةَ يتوضّأُ، فغسَلَ وجهَه ويدَيْه حتى كادَ يَبلُغُ المَنْكِبَيْن، ثم غسَلَ رِجلَيْهِ حتى كادَ يَبلُغُ السَّاقَيْن؛ ثم قال: سمعتُ رسولَ اللهِ ﷺ يقول:\n"
                  "\u2067\u00ABتبلُغُ الحِلْيَةُ من المؤمنِ حيثُ يبلُغُ الوضوءُ\u00BB\u2069.\n"
                  "وفي لفظِ مسلم: \u2067\u00ABسمعتُ خَليلِي يقول: تبلُغُ الحِلْيَةُ من المؤمنِ حيثُ يبلُغُ الوضوءُ\u00BB\u2069.\u202C",
              hadethNumber: 10,
              soundUrl: 'assets/sounds/10.ogg',
              explainUrl: 'https://youtu.be/U8dRtBjqHA4?si=atKxLiRdg-cM0Wd_',
            ),
            Hadeth(
              hadethText:
                  "\u202Bعن أنسِ بنِ مالكٍ رضيَ اللهُ عنه: أنَّ النبيَّ ﷺ كان إذا دخل الخلاء قال: \u2067\u00ABاللهم إني أعوذ بك من الخُبُثِ والخبائث\u00BB\u2069.\n\nالخُبُثُ: بضمِّ الخاءِ والباءِ؛ جمعُ خبيثٍ.\nوالخَبائِثُ: جمعُ خبيثة، والمرادُ بها ذُكورُ الشياطين وإناثُهم.\u202C",
              hadethNumber: 11,
              soundUrl: 'assets/sounds/11.ogg',
              explainUrl: 'https://youtu.be/xoMloPVla0c?si=O9uyOTfqln-LCQ3x',
            ),

            Hadeth(
              hadethText:
                  "\u202Bعن أبي أيوبَ الأنصاريِّ رضيَ اللهُ عنه قال: قال رسولُ اللهِ ﷺ: «إذا أتيتم الغائطَ فلا تستقبلوا القِبلةَ ببولٍ ولا غائطٍ، ولا تستدبروها، ولكن شرِّقوا أو غرِّبوا».\n\nقال أبو أيوبَ: فقدمْنا الشامَ فوجدْنا مراحيضَ قد بُنيت نحو الكعبةِ، فننحرفُ عنها ونستغفرُ اللهَ تعالى.\n\nالغائط: المُطمئنُّ من الأرض، كانوا ينتابونه للحاجة، فكنّوا به عن نفس الحدث؛ كراهيةً لذكره بخاصِّ اسمِه.\nوالمِرْحاض: جمع المراحيض، وهو المُغتسَل، وهو أيضًا كِناية عن موضع الغائط.\u202C",
              hadethNumber: 12,
              soundUrl: 'assets/sounds/12.ogg',
              explainUrl: 'https://youtu.be/fXZHeVtOONM?si=C2yJ22L_A46MT91I',
            ),
            Hadeth(
              hadethText:
                  "\u202Bعن عبدِ اللهِ بنِ عمرَ بنِ الخطابِ رضيَ اللهُ عنهما قال: «رقيتُ يومًا على بيتِ حفصةَ، فرأيتُ النبيَّ ﷺ يقضي حاجتَهُ مستقبِلَ الشامِ، مستدبِرَ الكعبةِ».\u202C",
              hadethNumber: 13,
              soundUrl: 'assets/sounds/13.ogg',
              explainUrl: 'https://youtu.be/LBf-FzQ2Xug?si=o-h76Pj0wl1phH75',
            ),
            Hadeth(
              hadethText:
                  "\u202Bعن أنسِ بنِ مالكٍ رضيَ اللهُ عنه قال: «كان رسولُ اللهِ ﷺ يدخلُ الخلاءَ، فأحملُ أنا وغُلامٌ نحوي إداوةً من ماءٍ وعَنَزةً، فيستنجي بالماءِ».\n\nالعَنَزة: الحُرْبة الصغيرة.\u202C",
              hadethNumber: 14,
              soundUrl: 'assets/sounds/14.ogg',
              explainUrl: 'https://youtu.be/xHofKt-ySe4?si=aJ_C5SY7lxuFOQLz',
            ),
            Hadeth(
              hadethText:
                  "\u202Bعن أبي قتادةَ الحارثِ بنِ ربعيٍّ الأنصاريِّ رضيَ اللهُ عنه أنَّ النبيَّ ﷺ قال: «لا يُمسِكَنَّ أحدُكم ذكرَهُ بيمينِه وهو يبولُ، ولا يتمسَّحْ من الخلاءِ بيمينِه، ولا يتنفَّسْ في الإناء».\u202C",
              hadethNumber: 15,
              soundUrl: 'assets/sounds/15.ogg',
              explainUrl: 'https://youtu.be/KsdqqnCWpVg?si=T2qOxFcgzUl4stHV',
            ),
            Hadeth(
              hadethText:
                  "\u202Bعن عبدِ اللهِ بنِ عباسٍ رضيَ اللهُ عنهما قال: «مرَّ النبيُّ ﷺ بقبرين، فقال: إنهما ليُعذَّبان، وما يُعذَّبان في كبير؛ أمَّا أحدُهما فكان لا يَستترُ من البول، وأما الآخر فكان يمشي بالنميمة».\nفأخذ جريدةً رطبةً فشقَّها نصفين، فغرز في كلِّ قبرٍ واحدةً.\nفقالوا: يا رسولَ اللهِ! لمَ فعلتَ هذا؟ فقال: «لعلَّه يُخفَّفُ عنهما ما لم يَيْبَسا».\u202C",
              hadethNumber: 16,
              soundUrl: 'assets/sounds/16.ogg',
              explainUrl: 'https://youtu.be/Yr-rGACWnPg?si=5ZQBJngF8bbCiJOC',
            ),
          ],
        ),
        Door(
          doorName: 'باب السواك',
          hadeths: [
            Hadeth(
              hadethText:
                  "\u202Bعن أبي هريرةَ رضيَ اللهُ عنه أنَّ رسولَ اللهِ ﷺ قال: «لولا أن أشقَّ على أمَّتي لأمرتُهم بالسِّواكِ عندَ كلِّ صلاةٍ».\u202C",
              hadethNumber: 17,
              soundUrl: 'assets/sounds/17.ogg',
              explainUrl: 'https://youtu.be/bdKl1D0qACY?si=I5dbOWDTA52Q4l-R',
            ),
            Hadeth(
              hadethText:
                  "\u202Bعن حُذَيفةَ بنِ اليَمان رضي الله عنه قال:\n"
                  "«كانَ النبي ﷺ إذا قامَ منَ الليلِ يَشوصُ فاهُ بالسِّواكِ».\n\n"
                  "يَشوص: معناه: يَغسِل؛ يُقال: شاصه يشوصه، ومَاصه يَموصه: إذا غسله.\u202C",
              hadethNumber: 18,
              soundUrl: 'assets/sounds/18.ogg',
              explainUrl: 'https://youtu.be/8xcsnqDjDDU?si=J13Ghzvd4j735PFh',
            ),
            Hadeth(
              hadethText:
                  "\u202Bعن عائشة رضي الله عنها قالت: «دخل عبد الرحمن بن أبي بكر على النبي ﷺ وأنا مسندته إلى صدري، ومع عبد الرحمن سواك رطب يستن به، فأبصره رسول الله ﷺ ببصره، فأخذت السواك فقطعته فمضغته، ثم دفعته إلى النبي ﷺ فاستن به.\n\n"
                  "فما رأيت رسول الله ﷺ استن استناناً أحسن منه، فما عدا أن فرغ رسول الله ﷺ رفع يده – أو إصبعه – ثم قال: «في الرفيق الأعلى» ثلاثاً – ثم قضى. وكانت تقول: مات بين حاقنتي وذاقنتي».\n\n"
                  "وفي لفظ: «رأيته ينظر إليه» – وعرفت أنه يحب السواك – فقلت: آخذه لك؟ فأشار برأسه أن نعم».\n\n"
                  "لفظ البخاري، ولمسلم: نحوه.\u202C",
              hadethNumber: 19,
              soundUrl: 'assets/sounds/19.ogg',
              explainUrl: 'https://youtu.be/yBGPSqmCQlg?si=gPIh-qvysI67-bes',
            ),
            Hadeth(
              hadethText:
                  "\u202Bعن أبي موسى رضي الله عنه قال: أتيت النبي ﷺ وهو يستاك بسواك، قال: وطرف السواك على لسانه، يقول: أع أع والسواك في فيه، كأنه يتهوع.\u202C",
              hadethNumber: 20,
              soundUrl: 'assets/sounds/20.ogg',
              explainUrl: 'https://youtu.be/5PmcD-4tcfc?si=TIwXUdsKVHGFoP4a',
            ),
          ],
        ),
        Door(
          doorName: 'باب المسح على الخفين',
          hadeths: [
            Hadeth(
              hadethText:
                  "\u202Bعن المغيرة بن شعبة رضي الله عنه قال: كنت مع النبي ﷺ في سفر، فأهويت لأنزع خفيه، فقال: دعهما، فإني أدخلتهما طاهرتين، فمسح عليهما.\u202C",
              hadethNumber: 21,
              soundUrl: 'assets/sounds/21.ogg',
              explainUrl: 'https://youtu.be/NEwkpHznEog?si=CLpJqUA3ZmFMAZj4',
            ),
            Hadeth(
              hadethText:
                  "\u202Bعن حذيفة بن اليمان رضي الله عنه قال: كنت مع النبي ﷺ، فبال، وتوضأ، ومسح على خفيه. مختصر.\u202C",
              hadethNumber: 22,
              soundUrl: 'assets/sounds/22.ogg',
              explainUrl: 'https://youtu.be/dPrf1jy4hHU?si=GLXLyGdOiijJVemp',
            ),
          ],
        ),
        Door(
          doorName: "باب في المذي وغيره",
          hadeths: [
            Hadeth(
              hadethText:
                  "\u202Bعن علي بن أبي طالب رضي الله عنه قال: كنت رجلاً مذاءً، فاستحييت أن أسأل رسول الله ﷺ لمكان ابنته، فأمرت المقداد بن الأسود فسأله، فقال: يغسل ذكره ويتوضأ.\n\n"
                  "وللبخاري: اغسل ذكرك وتوضأ.\n\n"
                  "ولمسلم: توضأ وانضح فرجك.\u202C",
              hadethNumber: 23,
              soundUrl: 'assets/sounds/23.ogg',
              explainUrl: 'https://youtu.be/dPrf1jy4hHU?si=_XqVxfLQWrHwFvCU',
            ),
            Hadeth(
              hadethText:
                  "\u202Bعن عباد بن تميم، عن عبد الله بن زيد بن عاصم المازني رضي الله عنه قال: شكي إلى النبي ﷺ الرجل يخيل إليه أنه يجد الشيء في الصلاة، قال: لا ينصرف حتى يسمع صوتاً، أو يجد ريحاً.\u202C",
              hadethNumber: 24,
              soundUrl: 'assets/sounds/24.ogg',
              explainUrl: 'https://youtu.be/hZux9eUg9QY?si=3VEQCuIJtB_tpLK9',
            ),
            Hadeth(
              hadethText:
                  "\u202Bعن أم قيس بنت محصن الأسدية رضي الله عنها: أنها أتت بابن لها صغير لم يأكل الطعام إلى رسول الله ﷺ فأجلسه رسول الله ﷺ في حجره، فبال على ثوبه، فدعا بماء فنضحه ولم يغسله.\u202C",
              hadethNumber: 25,
              soundUrl: 'assets/sounds/25.ogg',
              explainUrl: 'https://youtu.be/B-CVsCgxWws?si=4P9y9t7JAr3tVzis',
            ),
            Hadeth(
              hadethText:
                  "\u202Bعن عائشة – أم المؤمنين – رضي الله عنها قالت: أن النبي ﷺ بصبي فبال على ثوبه، فدعا بماء فأتبعه إياه.\n\n"
                  "ولمسلم: فأتبعه بوله ولم يغسله.\u202C",
              hadethNumber: 26,
              soundUrl: 'assets/sounds/26.ogg',
              explainUrl: 'https://youtu.be/KCea7UVzM8s?si=9P44PyrzzcXrpFSQ',
            ),
            Hadeth(
              hadethText:
                  "\u202Bعن أنس بن مالك رضي الله عنه قال: جاء أعرابي فبال في طائفة المسجد، فزجره الناس، فنهاهم النبي ﷺ، فلما قضى بوله أمر النبي ﷺ بذنوب من ماء فأهريق عليه.\u202C",
              hadethNumber: 27,
              soundUrl: 'assets/sounds/27.ogg',
              explainUrl: 'https://youtu.be/1h-wltVNivs?si=kfCmuKOY1B3qf8WT',
            ),
            Hadeth(
              hadethText:
                  "\u202Bعن أبي هريرة رضي الله عنه قال: سمعت النبي ﷺ يقول: الفطرة خمس: الختان، والاستحداد، وقص الشارب، وتقليم الأظفار، ونتف الإبط.\u202C",
              hadethNumber: 28,
              soundUrl: 'assets/sounds/28.ogg',
              explainUrl: 'https://youtu.be/ysPNgP1cqFU?si=pDZdeRbiKYCCyQm8',
            ),
          ],
        ),
        Door(
          doorName: 'باب الجنابة',
          hadeths: [
            Hadeth(
              hadethText:
                  "\u202Bعن أبي هريرة رضي الله عنه: أن النبي ﷺ لقيه في بعض طرق المدينة وهو جنب، فانخنست منه، فذهبت فاغتسلت، ثم جئت، فقال: أين كنت يا أبا هريرة؟ قال: كنت جنباً فكرهت أن أجالسك وأنا على غير طهارة، فقال: سبحان الله! إن المؤمن لا ينجس.\n\n"
                  "انخنست: انسلكت.\u202C",
              hadethNumber: 29,
              soundUrl: 'assets/sounds/29.ogg',
              explainUrl: 'https://youtu.be/ZnIUe8-1k8o?si=9lmEirFU4dqNwG4C',
            ),
            Hadeth(
              hadethText:
                  "\u202Bعن عائشة رضي الله عنها قالت: كان رسول الله ﷺ إذا اغتسل من الجنابة غسل يديه، وتوضأ وضوءه للصلاة، ثم اغتسل.\n\n"
                  "ثم يخلل بيديه شعره، حتى إذا ظن أنه قد أروى بشرته، أفاض عليه الماء ثلاث مرات.\n\n"
                  "ثم غسل سائر جسده.\n\n"
                  "وكانت تقول: كنت أغتسل أنا ورسول الله ﷺ من إناء واحد، نغترف منه جميعاً.\u202C",
              hadethNumber: 30,
              soundUrl: 'assets/sounds/30.ogg',
              explainUrl: 'https://youtu.be/1mNTudMqK_Q?si=OZBtSNo4HRtBFJa1',
            ),
            Hadeth(
              hadethText:
                  "\u202Bعن ميمونة بنت الحارث رضي الله عنها – زوج النبي ﷺ – قالت: توضأ رسول الله ﷺ وضوء الجنابة، فأكفأ بيمينه على يساره مرتين – أو ثلاثاً – ثم غسل فرجه، ثم ضرب يده بالأرض – أو الحائط – مرتين – أو ثلاثاً – ثم تمضمض واستنشق، وغسل وجهه وذراعيه، ثم أفاض على رأسه الماء، ثم غسل جسده.\n\n"
                  "ثم تنحى فغسل رجليه، فأتيته بخِرقة فلم يردها، فجعل ينفض الماء بيده.\u202C",
              hadethNumber: 31,
              soundUrl: 'assets/sounds/31.ogg',
              explainUrl: 'https://youtu.be/GBAF0Cx1IRY?si=jwuoKztqx_T-hvv_',
            ),
            Hadeth(
              hadethText:
                  "\u202Bعن عبد الله بن عمر أن عمر بن الخطاب رضي الله عنه قال: يا رسول الله! أيرقد أحدنا وهو جنب؟ قال: نعم، إذا توضأ أحدكم فليرقد.\u202C",
              hadethNumber: 32,
              soundUrl: 'assets/sounds/32.ogg',
              explainUrl: 'https://youtu.be/zgBmU4CPiG4?si=E6RxNZNNOfXGaaym',
            ),
            Hadeth(
              hadethText:
                  "\u202Bعن أم سلمة رضي الله عنها – زوج النبي ﷺ – قالت: جاءت أم سليم – امرأة أبي طلحة – إلى رسول الله ﷺ فقالت: يا رسول الله! إن الله لا يستحيي من الحق، هل على المرأة من غسل إذا هي احتلمت؟ فقال رسول الله ﷺ: نعم، إذا رأت الماء.\u202C",
              hadethNumber: 33,
              soundUrl: 'assets/sounds/33.ogg',
              explainUrl: 'https://youtu.be/ChaRwNp0qh0?si=C6wQx8qX7sgqtXh4',
            ),
            Hadeth(
              hadethText:
                  "\u202Bعن عائشة رضي الله عنها قالت: كنت أغسل الجنابة من ثوب رسول الله ﷺ، فيخرج إلى الصلاة وإن بقع الماء في ثوبه.\n\n"
                  "وفي لفظ لمسلم: لقد كنت أفركه من ثوب رسول الله ﷺ يابساً فيصلي فيه.\u202C",
              hadethNumber: 34,
              soundUrl: 'assets/sounds/34.ogg',
              explainUrl: 'https://youtu.be/qtyEtksfP_o?si=3ZOLIpSkne8ZG-Qj',
            ),

            Hadeth(
              hadethText:
                  "\u202Bعن أبي هريرة رضي الله عنه أن رسول الله ﷺ قال: إذا جلس بين شعبها الأربع، ثم جهدها، فقد وجب الغسل.\n\n"
                  "وفي لفظ: وإن لم ينزل.\u202C",
              hadethNumber: 35,
              soundUrl: 'assets/sounds/35.ogg',
              explainUrl: 'https://youtu.be/Rmhb2d4tLKY?si=nZxxdG0VAPaTuKZ-',
            ),
            Hadeth(
              hadethText:
                  "\u202Bعن أبي جعفر محمد بن علي بن الحسين بن علي بن أبي طالب: أنه كان هو وأبوه عند جابر بن عبد الله، وعنده قوم، فسألوه عن الغسل؟ فقال: يكفيك صاع. فقال رجل: ما يكفيني. فقال جابر: كان يكفي من هو أوفى منك شعراً، وخير منك، يريد النبي ﷺ. ثم أمّ في ثوب.\n\n"
                  "وفي لفظ: كان النبي ﷺ يفرغ على رأسه ثلاثاً.\n\n"
                  "الرجل الذي قال: ما يكفيني: هو الحسن بن محمد بن علي بن أبي طالب، أبوه: ابن الحنفية.\u202C",
              hadethNumber: 36,
              soundUrl: 'assets/sounds/36.ogg',
              explainUrl: 'https://youtu.be/j3sjvd7Vse8?si=efGlJJzruTYQLOXJ',
            ),
          ],
        ),
        Door(
          doorName: 'باب التيمم',
          hadeths: [
            Hadeth(
              hadethText:
                  "\u202Bعن عمران بن حصين رضي الله عنه: أن رسول الله ﷺ رأى رجلاً معتزلاً لم يصل في القوم، فقال: يا فلان! ما منعك أن تصلي في القوم؟ فقال: يا رسول الله! أصابتني جنابة ولا ماء. قال: عليك بالصعيد، فإنه يكفيك.\u202C",
              hadethNumber: 37,
              soundUrl: 'assets/sounds/37.ogg',
              explainUrl: 'https://youtu.be/OUAhQ-mbRF0?si=zQOIeGzv-BULmF1F',
            ),

            Hadeth(
              hadethText:
                  "\u202Bعن عمار بن ياسر رضي الله عنه قال: بعثني رسول الله ﷺ في حاجة فأجنبت، فلم أجد الماء، فتمرغت في الصعيد كما تمرغ الدابة، ثم أتيت النبي ﷺ فذكرت ذلك له.\n\n"
                  "فقال: إنما يكفيك أن تقول بيديك هكذا. ثم ضرب بيديه الأرض ضربة واحدة، ثم مسح الشمال على اليمين، وظاهر كفيه ووجهه.\u202C",
              hadethNumber: 38,
              soundUrl: 'assets/sounds/38.ogg',
              explainUrl: 'https://youtu.be/gsk41R87RgE?si=jfR66xHBd-a7UdaW',
            ),
            Hadeth(
              hadethText:
                  "\u202Bعن جابر بن عبد الله رضي الله عنه أن النبي ﷺ قال: أعطيت خمساً لم يعطهن أحد من الأنبياء قبلي: نصرت بالرعب مسيرة شهر، وجعلت لي الأرض مسجداً وطهوراً، فأيما رجل من أمتي أدركته الصلاة فليصل.\n\n"
                  "وأحلت لي الغنائم، ولم تحل لأحد قبلي، وأعطيت الشفاعة، وكان النبي يبعث إلى قومه خاصة، وبعثت إلى الناس عامة.\u202C",
              hadethNumber: 39,
              soundUrl: 'assets/sounds/39.ogg',
              explainUrl: 'https://youtu.be/o9IYuyVlIHk?si=xc7Br875bZ_T8fZD',
            ),
          ],
        ),
        Door(
          doorName: 'باب الحيض',
          hadeths: [
            Hadeth(
              hadethText:
                  "\u202Bعن عائشة رضي الله عنها: أن فاطمة بنت أبي حبيش سألت النبي ﷺ فقالت: إني أستحاض فلا أطهر، أفأدع الصلاة؟ فقال: لا، إن ذلك عرق، ولكن دعي الصلاة قدر الأيام التي كنت تحيضين فيها، ثم اغتسلي وصلي.\n\n"
                  "وفي رواية: وليست بالحيضة، فإذا أقبلت الحيضة فدعي الصلاة، فإذا ذهب قدرها فاغسلي عنك الدم وصلي.\u202C",
              hadethNumber: 40,
              soundUrl: 'assets/sounds/40.ogg',
              explainUrl: 'https://youtu.be/QMiyLJxsDpo?si=p15SD-0gt07ofSSX',
            ),

            Hadeth(
              hadethText:
                  "\u202Bعن عائشة رضي الله عنها: أن أم حبيبة رضي الله عنها استحيضت سبع سنين، فسألت رسول الله ﷺ عن ذلك، فأمرها أن تغتسل، فكانت تغتسل لكل صلاة.\u202C",
              hadethNumber: 41,
              soundUrl: 'assets/sounds/41.ogg',
              explainUrl: 'https://youtu.be/UQTtQ1Xv4GU?si=_gHIAWrogbSaiNlK',
            ),
            Hadeth(
              hadethText:
                  "\u202Bعن عائشة رضي الله عنها قالت: كنت أغتسل أنا والنبي ﷺ من إناء واحد، كلانا جنب، وكان يأمرني فأتزر، فيباشرني وأنا حائض. وكان يخرج رأسه إلي وهو معتكف فأغسله وأنا حائض.\u202C",
              hadethNumber: 42,
              soundUrl: 'assets/sounds/42.ogg',
              explainUrl: 'https://youtu.be/lI33LKb2Pbo?si=hjUEBXHDodopUuLO',
            ),

            Hadeth(
              hadethText:
                  "\u202Bعن عائشة رضي الله عنها قالت: كان رسول الله ﷺ يتكئ في حجري وأنا حائض، ثم يقرأ القرآن.\u202C",
              hadethNumber: 43,
              soundUrl: 'assets/sounds/43.ogg',
              explainUrl: 'https://youtu.be/tfk1i_QSC6s?si=8zjHIWODQYWPc9bO',
            ),

            Hadeth(
              hadethText:
                  "\u202Bعن معاذة قالت: سألت عائشة رضي الله عنها فقلت: ما بال الحائض تقضي الصوم ولا تقضي الصلاة؟ فقالت: أحرورية أنت؟ فقلت: لست بحرورية، ولكني أسأل. قالت: كان يصيبنا ذلك، فنؤمر بقضاء الصوم، ولا نؤمر بقضاء الصلاة.\u202C",
              hadethNumber: 44,
              soundUrl: 'assets/sounds/44.ogg',
              explainUrl: 'https://youtu.be/mBNEkDF6KTM?si=tsIG4gwY6VO2oEdH',
            ),
          ],
        ),
      ],
    ),

    //book 2 كتاب الصلاة
    Book(
      bookName: 'كتاب الصلاة',
      doors: [
        Door(
          doorName: 'باب المواقيت',
          hadeths: [
            Hadeth(
              hadethText:
                  "\u202Bعن أبي عمرو الشيباني – واسمه: سعد بن إياس – قال: حدثني صاحب هذه الدار، وأشار بيده إلى دار عبد الله بن مسعود رضي الله عنه، قال: سألت النبي ﷺ: أي العمل أحب إلى الله؟ قال: الصلاة على وقتها. قلت: ثم أي؟ قال: بر الوالدين. قلت: ثم أي؟ قال: الجهاد في سبيل الله. قال: حدثني بهن رسول الله ﷺ، ولو استزدته لزادني.\u202C",
              hadethNumber: 45,
              soundUrl: 'assets/sounds/45.ogg',
              explainUrl: 'https://youtu.be/MKO_OsdxGGc?si=q3svjYurseXrU_Ke',
            ),
            Hadeth(
              hadethText:
                  "\u202Bعن عائشة رضي الله عنها قالت: لقد كان رسول الله ﷺ يصلي الفجر، فيشهد معه نساء من المؤمنات متلفعات بمروطهن، ثم يرجعن إلى بيوتهن ما يعرفهن أحد من الغلس.\n\n"
                  "المروط: أكسية معلمة تكون من خز، وتكون من صوف.\n"
                  "ومتلفعات: ملتحفات.\n"
                  "والغلس: اختلاط ضياء الصبح بظلمة الليل.\u202C",
              hadethNumber: 46,
              soundUrl: 'assets/sounds/46.ogg',
              explainUrl: 'https://youtu.be/rDRRmnyQiD0?si=3pGsBLrzMlys5HCF',
            ),
            Hadeth(
              hadethText:
                  "\u202Bعن جابر بن عبد الله رضي الله عنه قال: كان النبي ﷺ يصلي الظهر بالهاجرة، والعصر والشمس نقية، والمغرب إذا وجبت، والعشاء أحياناً وأحياناً، إذا رآهم اجتمعوا عجل، وإذا رآهم أبطؤوا أخر، والصبح كان النبي ﷺ يصليها بغلس.\u202C",
              hadethNumber: 47,
              soundUrl: 'assets/sounds/47.ogg',
              explainUrl: 'https://youtu.be/X8IiKhd6Uio?si=79k3dFgyJ5P7Nsxu',
            ),
            Hadeth(
              hadethText:
                  "\u202Bعن أبي المنهال سيار بن سلامة قال: دخلت أنا وأبي على أبي برزة الأسلمي رضي الله عنه، فقال له أبي: كيف كان رسول الله ﷺ يصلي المكتوبة؟\n\n"
                  "فقال: كان يصلي الهاجرة – التي تدعونها الأولى – حين تدحض الشمس، ويصلي العصر، ثم يرجع أحدنا إلى رحله في أقصى المدينة والشمس حية، ونسيت ما قال في المغرب.\n\n"
                  "وكان يستحب أن يؤخر من العشاء – التي تدعونها العتمة – وكان يكره النوم قبلها والحديث بعدها.\n\n"
                  "وكان ينفتل من صلاة الغداة حين يعرف الرجل جليسه، ويقرأ بالستين إلى المائة.\u202C",
              hadethNumber: 48,
              soundUrl: 'assets/sounds/48.ogg',
              explainUrl: 'https://youtu.be/RG-j1LdMcTw?si=qTzgTKoRbut3cLKx',
            ),
            Hadeth(
              hadethText:
                  "\u202Bعن علي بن أبي طالب رضي الله عنه: أن النبي ﷺ قال يوم الخندق: «مَلأَ اللَّهُ قُبُورَهُمْ نَارًا، كَمَا شَغَلُونَا عَنِ الصَّلَاةِ الْوُسْطَى حَتَّى غَابَتِ الشَّمْسُ».\n\n"
                  "وفي لفظ لمسلم: «شَغَلُونَا عَنِ الصَّلَاةِ الْوُسْطَى – صَلَاةِ الْعَصْرِ – ثُمَّ صَلَّاهَا بَيْنَ الْمَغْرِبِ وَالْعِشَاءِ».\n\n"
                  "وله عن عبد الله بن مسعود رضي الله عنه قال: «حَبَسَ الْمُشْرِكُونَ رَسُولَ اللَّهِ ﷺ عَنْ صَلَاةِ الْعَصْرِ حَتَّى احْمَرَّتِ الشَّمْسُ أَوِ اصْفَرَّتْ، فَقَالَ رَسُولُ اللَّهِ ﷺ: شَغَلُونَا عَنِ الصَّلَاةِ الْوُسْطَى – صَلَاةِ الْعَصْرِ – مَلأَ اللَّهُ أَجْوَافَهُمْ وَقُبُورَهُمْ نَارًا – أَوْ حَشَا اللَّهُ أَجْوَافَهُمْ وَقُبُورَهُمْ نَارًا –».\u202C",
              hadethNumber: 49,
              soundUrl: 'assets/sounds/49.ogg',
              explainUrl: 'https://youtu.be/nh4dRLLxfzQ?si=bZZbZtejlqTDSZ2-',
            ),

            Hadeth(
              hadethText:
                  "\u202Bعن عبد الله بن عباس رضي الله عنهما قال: أعتم النبي ﷺ بالعشاء، فخرج عمر فقال: الصلاة يا رسول الله! رقد نام النساء والصبيان، فخرج ورأسه يقطر يقول: لولا أن أشق على أمتي – أو على الناس – لأمرتهم بهذه الصلاة هذه الساعة.\u202C",
              hadethNumber: 50,
              soundUrl: 'assets/sounds/50.ogg',
              explainUrl: 'https://youtu.be/iPOeL8j3Yuo?si=HLGPomYOTPurKH1Z',
            ),

            Hadeth(
              hadethText:
                  "\u202Bعن عائشة رضي الله عنها، عن النبي ﷺ قال: إذا أقيمت الصلاة وحضر العشاء، فابدؤوا بالعشاء.\n\n"
                  "وعن ابن عمر رضي الله عنه نحوه.\n\n"
                  "ولمسلم عن عائشة رضي الله عنها قالت: سمعت رسول الله ﷺ يقول: لا صلاة بحضرة طعام، ولا وهو يدافعه الأخبثان.\u202C",
              hadethNumber: 51,
              soundUrl: 'assets/sounds/51.ogg',
              explainUrl: 'https://youtu.be/BZJfQMs-C4g?si=dDNf_btqpRXU7fUJ',
            ),
            Hadeth(
              hadethText:
                  "\u202Bعن عبد الله بن عباس رضي الله عنهما قال: شهد عندي رجال مرضيون، وأرضاهم عندي عمر – أن رسول الله ﷺ نهى عن الصلاة بعد الصبح حتى تشرق الشمس، وبعد العصر حتى تغرب.\n\n"
                  "شَرَقَت الشمس: إذا طلعت.\n"
                  "وأشرقت: إذا أضاءت وصفت.\u202C",
              hadethNumber: 52,
              soundUrl: 'assets/sounds/52.ogg',
              explainUrl: 'https://youtu.be/JZkcOZ__IIg?si=NOPP-z4Fw0FU2ate',
            ),

            Hadeth(
              hadethText:
                  "\u202Bعن أبي سعيد الخدري رضي الله عنه، عن رسول الله ﷺ قال: «لا صلاة بعد الصبح حتى ترتفع الشمس، ولا صلاة بعد العصر حتى تغيب الشمس».\n\n"
                  "وفي الباب: عن علي بن أبي طالب، وعبد الله بن مسعود، وعبد الله بن عمر بن الخطاب، وعبد الله بن عمرو بن العاص، وأبي هريرة، وسمرة بن جندب، وسلمة بن الأكوع، وزيد بن ثابت، ومعاذ بن جبل، وعقبة بن عامر، وكعب بن مرة، وأبي أمامة الباهلي، وعمرو بن عبسة السلمي، وعائشة، والصنابحي – ولم يسمع من النبي ﷺ –.\u202C",
              hadethNumber: 53,
              soundUrl: 'assets/sounds/53.ogg',
              explainUrl: 'https://youtu.be/dtTOR10bqa8?si=9_jO3gYX6RsrGGO4',
            ),

            Hadeth(
              hadethText:
                  "\u202Bعن جابر بن عبد الله رضي الله عنهما، أن عمر بن الخطاب رضي الله عنه جاء يوم الخندق بعدما غربت الشمس، فجعل يسب كفار قريش، ويقول: يا رسول الله! ما كدت أصلي العصر حتى كادت الشمس تغرب. فقال النبي ﷺ: والله ما صليتها! قال: فقمنا إلى بطحان، فتوضأ للصلاة وتوضأنا لها، فصلى العصر بعدما غربت الشمس، ثم صلى بعدها المغرب.\u202C",
              hadethNumber: 54,
              soundUrl: 'assets/sounds/54.ogg',
              explainUrl: 'https://youtu.be/D8Ic4FNWFic?si=KFtjCT8boD9_thhQ',
            ),
          ],
        ),
        Door(
          doorName: 'باب فضل صلاة الجماعة ووجوباها',
          hadeths: [
            Hadeth(
              hadethText:
                  "\u202Bعن عبدِ اللهِ بنِ عمرَ رضيَ اللهُ عنهما أنَّ رسولَ الله ﷺ قال: «صلاةُ الجماعةِ أفضلُ من صلاةِ الفَذِّ بسَبعٍ وعشرينَ درجةً».\u202C",
              hadethNumber: 55,
              soundUrl: 'assets/sounds/55.ogg',
              explainUrl: 'https://youtu.be/uxxDcgR70yk?si=81CwkZJbvf_dFxqA',
            ),

            Hadeth(
              hadethText:
                  "\u202Bعن أبي هريرةَ رضيَ اللهُ عنه قال: قال رسولُ الله ﷺ: «صلاةُ الرجلِ في الجماعةِ تُضعَّفُ على صلاتِه في بيتِه وفي سوقِه خمسًا وعشرينَ ضعفًا.\n"
                  "وذلك أنَّه: إذا توضَّأ فأحسنَ الوضوءَ، ثم خرجَ إلى المسجدِ لا يُخرِجُه إلا الصلاةُ، لم يَخطُ خطوةً إلا رُفِعتْ له بها درجةٌ، وحُطَّ عنه بها خطيئةٌ.\n"
                  "فإذا صلَّى لم تَزَلِ الملائكةُ تُصلِّي عليه ما دامَ في مُصلَّاه: اللهم صلِّ عليه! اللهم ارحَمه! ولا يزالُ في صلاةٍ ما انتظر الصلاةَ».\u202C",
              hadethNumber: 56,
              soundUrl: 'assets/sounds/56.ogg',
              explainUrl: 'https://youtu.be/Sap7tHZYamw?si=4o2bIvyou2u5D1vT',
            ),
            Hadeth(
              hadethText:
                  "\u202Bوعنه رضي الله عنه قال: قال رسول الله ﷺ: «أثقلُ الصلاةِ على المنافقينَ: صلاةُ العشاءِ، وصلاةُ الفجرِ، ولو يعلمونَ ما فيهما لأتوهما ولو حَبوًا.\n"
                  "ولقد هممتُ أن آمرَ بالصلاةِ فتقامَ، ثم آمرَ رجلًا يُصلِّي بالناسِ، ثم أنطلِقُ معي برجالٍ معهم حُزَمٌ من حطبٍ إلى قومٍ لا يشهدونَ الصلاةَ، فأحرِّقَ عليهم بيوتهم بالنار».\u202C",
              hadethNumber: 57,
              soundUrl: 'assets/sounds/57.ogg',
              explainUrl: 'https://youtu.be/qiGjlCzuQeo?si=CrS2VSMCcXC6wqkt',
            ),

            Hadeth(
              hadethText:
                  "\u202Bعن عبد الله بن عمرَ رضيَ اللهُ عنهما عن النبي ﷺ قال: «إذا استأذنتِ امرأةُ أحدِكم إلى المسجدِ فلا يمنعها».\n"
                  "قال: فقال بلالُ بن عبد الله: والله لنمنعهنَّ.\n"
                  "قال: فأقبلَ عليه عبدُ الله فسبَّه سبًّا سيِّئًا ما سمعتُه سبَّه مثلَه قطُّ، وقال: أُخبِرك عن رسولِ الله ﷺ وتقولُ: والله لنمنعهنَّ؟!\n\n"
                  "وفي لفظ: «لا تمنعوا إماءَ اللهِ مساجدَ الله».\u202C",
              hadethNumber: 58,
              soundUrl: 'assets/sounds/58.ogg',
              explainUrl: 'https://youtu.be/z6VhsTzdFjc?si=jUBFaRq_siExHXR9',
            ),
            Hadeth(
              hadethText:
                  "\u202Bعن عبد الله بن عمر رضي الله عنهما قال: «صلَّيتُ مع رسولِ الله ﷺ ركعتَينِ قبلَ الظُّهر، وركعتَينِ بعدَ الظُّهر، وركعتَينِ بعدَ الجُمعة، وركعتَينِ بعدَ المغرب، وركعتَينِ بعدَ العِشاء».\n\n"
                  "وفي لفظٍ: «أمَّا المغربُ والعِشاءُ والجُمعةُ ففي بيتِهِ».\n\n"
                  "وفي لفظٍ: أنَّ ابنَ عمرَ رضيَ اللهُ عنهما قال: «حدَّثتني حفصةُ: أنَّ النبي ﷺ كان يُصلِّي ركعتَينِ خفيفتَينِ بعدما يطلُعُ الفجرُ، وكانت ساعةً لا أدخلُ على النبي ﷺ فيها».\u202C",
              hadethNumber: 59,
              soundUrl: 'assets/sounds/59.ogg',
              explainUrl: 'https://youtu.be/F68pVNT46nI?si=zzE5gTS0f8A2u6B5',
            ),

            Hadeth(
              hadethText:
                  "\u202Bعن عائشةَ رضي الله عنها قالت: «لم يكنِ النبي ﷺ على شيءٍ من النوافلِ أشدَّ تعاهُدًا منه على ركعتَيِ الفجر».\n\n"
                  "وفي لفظٍ لمسلم: «ركعتا الفجرِ خيرٌ من الدنيا وما فيها».\u202C",
              hadethNumber: 60,
              soundUrl: 'assets/sounds/60.ogg',
              explainUrl: 'https://youtu.be/nzYvv9uSocM?si=Jw0uarmBmbpa8RuZ',
            ),
          ],
        ),
        Door(
          doorName: 'باب الاذان',
          hadeths: [
            Hadeth(
              hadethText:
                  "\u202Bعن أنسِ بنِ مالكٍ رضي الله عنه قال: «أُمر بلالٌ أن يشفعَ الأذانَ، ويُوترَ الإقامةَ».\u202C",
              hadethNumber: 61,
              soundUrl: 'assets/sounds/61.ogg',
              explainUrl: 'https://youtu.be/5irgtO7kkCI?si=TjXUL52nxeoVznwG',
            ),

            Hadeth(
              hadethText:
                  "\u202Bعن أبي جُحيفةَ وَهبِ بنِ عبدِ اللهِ السوائيِّ قال: أتيتُ النبي ﷺ وهو في قُبَّةٍ له حمراءَ من أَدَمٍ، فخرج بلالٌ بوَضوئِه، فمن ناضِحٍ ونائلٍ، فخرج النبي ﷺ وعليه حُلَّةٌ حمراءُ – كأني أنظرُ إلى بَياضِ ساقَيه –.\n"
                  "قال: فتوضأ وأذَّن بلالٌ، قال: فجعلتُ أتتبَّعُ فاهُ هاهنا وهاهنا يقولُ: يمينًا وشِمالًا: حيَّ على الصلاة! حيَّ على الفلاح!\n"
                  "ثم ركزتُ له عنزةً، فتقدَّم فصلَّى الظُّهرَ ركعتَين، ثم لم يزل يُصلِّي ركعتَين ركعتَين حتى رجع إلى المدينة».\u202C",
              hadethNumber: 62,
              soundUrl: 'assets/sounds/62.ogg',
              explainUrl: 'https://youtu.be/lxxenUl1Nio?si=j1d3bXFG9ze3EoPn',
            ),
            Hadeth(
              hadethText:
                  "\u202Bعن عبد الله بن عمر رضي الله عنهما عن رسول الله ﷺ أنه قال: «إنَّ بلالًا يُؤذِّنُ بليلٍ، فكلوا واشربوا حتى تسمعوا أذانَ ابنِ أُمِّ مكتومٍ».\u202C",
              hadethNumber: 63,
              soundUrl: 'assets/sounds/63.ogg',
              explainUrl: 'https://youtu.be/NCrTOeXRzhw?si=-rEUYxqx82irhFwr',
            ),

            Hadeth(
              hadethText:
                  "\u202Bعن أبي سعيدٍ الخدريِّ رضي الله عنه قال: قال رسول الله ﷺ: «إذا سمعتم المؤذِّنَ فقولوا مثلَ ما يقول».\u202C",
              hadethNumber: 64,
              soundUrl: 'assets/sounds/64.ogg',
              explainUrl: 'https://youtu.be/d3U87j45Rog?si=wJf0M4DErS90f4o0',
            ),
          ],
        ),
        Door(
          doorName: 'باب استقبال القبلة',
          hadeths: [
            Hadeth(
              hadethText:
                  "\u202Bعن عبد الله بن عمر رضي الله عنهما: «أن رسولَ الله ﷺ كان يُسبِّحُ على ظهرِ راحلتِه حيث كان وجهُهُ، يومئُ برأسِه، وكان ابنُ عمرَ رضي الله عنهما يفعلُه».\n"
                  "وفي رواية: «كان يُوترُ على بعيرِه».\n\n"
                  "ولمسلم: «غيرَ أنه لا يُصلِّي عليها المكتوبةَ».\n"
                  "وللبخاري: «إلا الفرائضَ».\u202C",
              hadethNumber: 65,
              soundUrl: 'assets/sounds/65.ogg',
              explainUrl: 'https://youtu.be/BYDbHIuqvyw?si=_M_J30QvoUwyVnu2',
            ),

            Hadeth(
              hadethText:
                  "\u202Bعن عبد الله بن عمر رضي الله عنهما قال: «بينما الناسُ بقباءَ في صلاةِ الصبحِ إذ جاءهم آتٍ فقال: إن النبي ﷺ قد أُنزِل عليه الليلةَ قرآنٌ، وقد أُمِر أن يَستقبِلَ القبلةَ فاستَقبِلوها، وكانت وجوهُهم إلى الشام، فاستداروا إلى الكعبة».\u202C",
              hadethNumber: 66,
              soundUrl: 'assets/sounds/66.ogg',
              explainUrl: 'https://youtu.be/hGKY40wX4a4?si=5gYb_FZByfhiukW7',
            ),
            Hadeth(
              hadethText:
                  "\u202Bعن أنسِ بنِ سيرينَ قال: استقبلنا أنسًا رضي الله عنه حين قدِم من الشام، فلَقيناه بعينِ التمر، فرأيتُه يُصلِّي على حمارٍ ووجهُه من ذا الجانب – يعني: عن يسارِ القبلة –.\n"
                  "فقلتُ: رأيتُكَ تُصلِّي لغيرِ القبلة!\n"
                  "فقال: لولا أني رأيتُ رسولَ الله ﷺ يفعلُه لم أفعلْه».\u202C",
              hadethNumber: 67,
              soundUrl: 'assets/sounds/67.ogg',
              explainUrl: 'https://youtu.be/7-zfOLJdyPI?si=PNK-0JNBn19XUjQw',
            ),
          ],
        ),
        Door(
          doorName: 'باب الصفوف',
          hadeths: [
            Hadeth(
              hadethText:
                  "\u202Bعن أنسِ بنِ مالكٍ رضي الله عنه قال: قال رسولُ الله ﷺ: «سوُّوا صفوفَكم؛ فإنَّ تسويةَ الصفِّ من تمامِ الصلاة».\u202C",
              hadethNumber: 68,
              soundUrl: 'assets/sounds/68.ogg',
              explainUrl: 'https://youtu.be/N6ND_Y9m6kE?si=q4Cqk2TbRQHbZsDH',
            ),

            Hadeth(
              hadethText:
                  "\u202Bعن النعمانِ بنِ بشيرٍ رضي الله عنه قال: سمعتُ رسولَ الله ﷺ يقول: «لتُسوُّنَّ صفوفَكم أو ليُخالِفنَّ اللهُ بين وجوهِكم».\n\n"
                  "ولمسلم: «كان رسولُ الله ﷺ يُسوِّي صفوفَنا، حتى كأنما يُسوِّي بها القداح، حتى رأى أن قد عقلنا .\n\n"
                  "ثم خرج يومًا فقام حتى كاد يكبِّر، فرأى رجلًا بادِيًا صدرُه، فقال: «عبادَ الله! لتُسوُّنَّ صفوفَكم، أو ليُخالِفنَّ اللهُ بين وجوهِكم».\u202C",
              hadethNumber: 69,
              soundUrl: 'assets/sounds/69.ogg',
              explainUrl: 'https://youtu.be/xFX-3KVjmfY?si=3QWDZuhMhbuj3FJl',
            ),

            Hadeth(
              hadethText:
                  "\u202Bعن أنسِ بنِ مالكٍ رضي الله عنه: «أن جدَّتَه مليكة دَعَت رسولَ الله ﷺ لطعامٍ صنعَتْه، فأكلَ منه، ثم قال: قوموا فلأُصلِّيَ لكم.\n"
                  "قال أنس: فقمتُ إلى حصيرٍ لنا قد أسودَّ من طولِ ما لُبِس، فنضحْتُه بماءٍ، فقام عليه رسولُ الله ﷺ، وصففتُ أنا والتِّيمُ وراءَه، فصلَّى لنا ركعتَينِ، ثم انصرفَ».\n\n"
                  "ولمسلم: «أن رسولَ الله ﷺ صلى به وبأُمِّه، فأقامني عن يمينِه، وأقام المرأةَ خلفَنا».\n\n"
                  "واليتيم: قيل هو: ضُميرةُ، جدُّ حُسَينِ بنِ عبدِ اللهِ بنِ ضُميرة».\u202C",
              hadethNumber: 70,
              soundUrl: 'assets/sounds/70.ogg',
              explainUrl: 'https://youtu.be/oqJgPzhkNMY?si=em9cdKrFme3v-Mpi',
            ),

            Hadeth(
              hadethText:
                  "\u202Bعن عبدِ اللهِ بنِ عباسٍ رضي الله عنهما قال: «بِتُّ عند خالتي ميمونةَ رضي الله عنها، فقام النبي ﷺ يُصلِّي من الليل، فقمتُ عن يسارِه، فأخذ برأسي فأقامني عن يمينِه».\u202C",
              hadethNumber: 71,
              soundUrl: 'assets/sounds/71.ogg',
              explainUrl: 'https://youtu.be/4_hEmxo-oCw?si=j1yk9LU5MYtyuPxD',
            ),
          ],
        ),
        Door(
          doorName: 'باب الامامة',
          hadeths: [
            Hadeth(
              hadethText:
                  "\u202Bعن أبي هريرةَ رضي الله عنه عن النبي ﷺ قال: «أما يخشى الذي يرفع رأسَه قبلَ الإمامِ أن يُحوِّلَ اللهُ رأسَه رأسَ حمارٍ! أو يجعلَ صورتَه صورةَ حمارٍ!».\u202C",
              hadethNumber: 72,
              soundUrl: 'assets/sounds/72.ogg',
              explainUrl: 'https://youtu.be/PgfyaynECbE?si=CC9vaWp1-BiTgpBP',
            ),

            Hadeth(
              hadethText:
                  "\u202Bعن أبي هريرةَ رضي الله عنه عن النبي ﷺ قال: «إنما جُعِلَ الإمامُ ليُؤتَمَّ به، فلا تختلفوا عليه.\n"
                  "فإذا كبَّر فكبِّروا، وإذا ركع فاركعوا، وإذا قال: سمع اللهُ لمن حمده، فقولوا: ربَّنا ولك الحمد.\n"
                  "وإذا سجد فاسجدوا، وإذا صلَّى جالسًا فصلُّوا جلوسًا أجمعون».\u202C",
              hadethNumber: 73,
              soundUrl: 'assets/sounds/73.ogg',
              explainUrl: 'https://youtu.be/LAWr3dycJA0?si=jKu2Yn7ez-VT5yVj',
            ),
            Hadeth(
              hadethText:
                  "\u202Bعن عائشةَ رضي الله عنها قالت: «صلَّى رسولُ الله ﷺ في بيتِه وهو شاكٍ، فصلَّى جالسًا، وصلَّى وراءَه قومٌ قيامًا، فأشارَ إليهم أنِ اجلسوا. فلمَّا انصرفَ قال: إنما جُعِلَ الإمامُ ليُؤتَمَّ به.\n"
                  "فإذا ركع فاركعوا، وإذا رفع فارفعوا، وإذا قال: سمع اللهُ لمن حمده، فقولوا: ربَّنا ولك الحمد.\n"
                  "وإذا سجد فاسجدوا، وإذا صلَّى جالسًا فصلُّوا جلوسًا أجمعون».\u202C",
              hadethNumber: 74,
              soundUrl: 'assets/sounds/74.ogg',
              explainUrl: 'https://youtu.be/kCE_mo2z55M?si=njsrXWVTwdkBROH2',
            ),
            Hadeth(
              hadethText:
                  "\u202Bعن عبدِ اللهِ بنِ يزيدَ الخطميِّ الأنصاريِّ قال: «حدَّثني البراءُ بنُ عازبٍ رضي الله عنهما – وهو غيرُ كذوبٍ – قال: كانوا إذا قال رسولُ الله ﷺ: سمع اللهُ لمن حمده، لم يحنِ أحدٌ منا ظهرَه حتى يقعَ رسولُ الله ﷺ ساجدًا، ثم نقعُ سجودًا بعده».\u202C",
              hadethNumber: 75,
              soundUrl: 'assets/sounds/75.ogg',
              explainUrl: 'https://youtu.be/kCE_mo2z55M?si=njsrXWVTwdkBROH2',
            ),

            Hadeth(
              hadethText:
                  "\u202Bعن أبي هريرةَ رضي الله عنه أن رسولَ الله ﷺ قال: «إذا أمَّنَ الإمامُ فأمِّنوا، فإنه مَن وافق تأمينُه تأمينَ الملائكةِ غُفِر له ما تقدَّم من ذنبِه».\u202C",
              hadethNumber: 76,
              soundUrl: 'assets/sounds/76.ogg',
              explainUrl: 'https://youtu.be/ojmsG0ps7qM?si=ZAds6lfnWgdbRvQv',
            ),
            Hadeth(
              hadethText:
                  "\u202Bعن أبي هريرةَ رضي الله عنه أن رسولَ الله ﷺ قال: «إذا صلَّى أحدُكم للناسِ فليُخفِّفْ، فإنَّ فيهم الضَّعيفَ والسقيمَ وذا الحاجة، وإذا صلَّى أحدُكم لنفسِه فليُطوِّلْ ما شاء».\u202C",
              hadethNumber: 77,
              soundUrl: 'assets/sounds/77.ogg',
              explainUrl: 'https://youtu.be/1mrGgjtZoew?si=o7kRiZ2yWMHLcniN',
            ),

            Hadeth(
              hadethText:
                  "\u202Bعن أبي مسعودٍ الأنصاريِّ رضي الله عنه قال: «جاء رجلٌ إلى رسولِ الله ﷺ فقال: يا رسولَ الله، إني لأتأخَّرُ عن صلاةِ الصبحِ من أجلِ فلانٍ مما يُطيلُ بنا.\n"
                  "فما رأيتُ النبي ﷺ غضب في موعظةٍ قطُّ أشدَّ مما غضب يومئذٍ، فقال: يا أيها الناسُ! إنَّ منكم منفِّرين.\n"
                  "فأيُّكم أمَّ الناسَ فليُوجِزْ، فإنَّ فيهم الكبيرَ والضعيفَ وذا الحاجة».\u202C",
              hadethNumber: 78,
              soundUrl: 'assets/sounds/78.ogg',
              explainUrl: 'https://youtu.be/l99WEAYioBE?si=PjAYbmW86jnc5yHz',
            ),
          ],
        ),
        Door(
          doorName: 'باب صفة صلاة النبي',
          hadeths: [
            Hadeth(
              hadethText:
                  "عن أبي هريرة رضي الله عنه قال: (كان رسول الله ﷺ إذا كبَّر في الصلاة سكت هُنيَّةً قبل أن يقرأ، فقلتُ: يا رسول الله، بأبي أنت وأمي، أرأيتَ سكوتك بين التكبير والقراءة ما تقول؟\n"
                  "قال: أقول: اللهم باعِد بيني وبين خطاياي كما باعدتَ بين المشرق والمغرب، اللهم نقِّني من خطاياي كما يُنقَّى الثوبُ الأبيض من الدنس، اللهم اغسِلني من خطاياي بالثلج والماء والبَرَد).",
              hadethNumber: 79,
              soundUrl: 'assets/sounds/79.ogg',
              explainUrl: 'https://youtu.be/d0f1OX2aTws?si=_b3jPElXnor9iAqC',
            ),
            Hadeth(
              hadethText:
                  "عن عائشة رضي الله عنها قالت: «كان رسول الله ﷺ يفتتح الصلاة بالتكبير، والقراءة بـ ﴿الحمد لله رب العالمين﴾، وكان إذا ركع لم يُشخص رأسه ولم يُصوِّبه، ولكن بين ذلك.\n"
                  "وكان إذا رفع رأسه من الركوع لم يسجد حتى يستوي قائمًا.\n"
                  "وكان إذا رفع رأسه من السجدة لم يسجد حتى يستوي قاعدًا.\n"
                  "وكان يقول في كل ركعتين: التحية.\n"
                  "وكان يفرش رجله اليسرى وينصب رجله اليمنى.\n"
                  "وكان ينهى عن عقبة الشيطان، وينهى أن يفترش الرجل ذراعيه افتراش السبع.\n"
                  "وكان يختم الصلاة بالتسليم». ",
              hadethNumber: 80,
              soundUrl: 'assets/sounds/80.ogg',
              explainUrl: 'https://youtu.be/KKRiXcGNfsQ?si=XfOFWW6SR941R0Cd',
            ),
            Hadeth(
              hadethText:
                  "عن عبد الله بن عمر رضي الله عنهما: أن النبي ﷺ كان يرفع يديه حذو منكبيه إذا افتتح الصلاة، وإذا كبَّر للركوع.\n"
                  "وإذا رفع رأسه من الركوع رفعهما كذلك، وقال: سمع الله لمن حمده، ربنا ولك الحمد.\n"
                  "وكان لا يفعل ذلك في السجود.",
              hadethNumber: 81,
              soundUrl: 'assets/sounds/81.ogg',
              explainUrl: 'https://youtu.be/q-WjFV2JSCs?si=HQeqDclUaxHCDZtl',
            ),
            Hadeth(
              hadethText:
                  "عن عبد الله بن عباس رضي الله عنهما قال: قال رسول الله ﷺ: أُمرت أن أسجد على سبعة أعظم: على الجبهة – وأشار بيده إلى أنفه – واليدين، والركبتين، وأطراف القدمين.",
              hadethNumber: 82,
              soundUrl: 'assets/sounds/82.ogg',
              explainUrl: 'https://youtu.be/qRQ_41-aX4M?si=quIO3otxqfu6n1sB',
            ),

            Hadeth(
              hadethText:
                  "عن أبي هريرة رضي الله عنه قال: (كان رسول الله ﷺ إذا قام إلى الصلاة كبَّر حين يقوم، ثم يكبر حين يركع، ثم يقول: سمع الله لمن حمده، حين يرفع صُلبه من الركوع، ثم يقول وهو قائم: ربنا ولك الحمد.\n"
                  "ثم يكبر حين يهوي، ثم يكبر حين يرفع رأسه، ثم يكبر حين يسجد، ثم يكبر حين يرفع رأسه، ثم يفعل ذلك في صلاته كلها حتى يقضيها، ويكبر حين يقوم من الثنتين بعد الجلوس).",
              hadethNumber: 83,
              soundUrl: 'assets/sounds/83.ogg',
              explainUrl: 'https://youtu.be/cmexuz851Ug?si=4zkAkx5DHWyCAsHJ',
            ),
            Hadeth(
              hadethText:
                  "عن مطرف بن عبد الله قال: صليتُ أنا وعمران بن حصين خلف علي بن أبي طالب رضي الله عنه، فكان إذا سجد كبَّر، وإذا رفع رأسه كبَّر، وإذا نهض من الركعتين كبَّر.\n"
                  "فلما قضى الصلاة أخذ بيدي عمران بن حصين فقال: قد ذكَّرني هذا صلاة محمد ﷺ، أو قال: صلى بنا صلاة محمد ﷺ.",
              hadethNumber: 84,
              soundUrl: 'assets/sounds/84.ogg',
              explainUrl: 'https://youtu.be/KCQ6ph4eCKs?si=Q8SOHxx8faRhodJH',
            ),

            Hadeth(
              hadethText:
                  "عن البراء بن عازب رضي الله عنه قال: (رمقتُ الصلاة مع محمد ﷺ فوجدت قيامه، فركعته، فاعتداله بعد ركوعه، فسجدته، فجلس بين السجدتين، فسجدته، فجلسة ما بين التسليم والانصراف، قريبًا من السواء).\n"
                  "وفي رواية البخاري: (ما خلا القيام والقعود قريبًا من السواء).",
              hadethNumber: 85,
              soundUrl: 'assets/sounds/85.ogg',
              explainUrl: 'https://youtu.be/vih3AH6QQ3w?si=Z7c1cKdWqiKMd4Ax',
            ),
            Hadeth(
              hadethText:
                  "عن ثابت البناني، عن أنس بن مالك رضي الله عنه قال: (إني لا آلُو أن أُصلي بكم كما رأيت رسول الله ﷺ يصلي بنا).\n"
                  "قال ثابت: فكان أنس يصنع شيئًا لا أراكم تصنعونه: كان إذا رفع رأسه من الركوع انتصب قائمًا حتى يقول القائل: قد نسي، وإذا رفع من السجدة مكث حتى يقول القائل: قد نسي).",
              hadethNumber: 86,
              soundUrl: 'assets/sounds/86.ogg',
              explainUrl: 'https://youtu.be/mU1eVBPjED8?si=mIkVTIh6csnQLpRY',
            ),
            Hadeth(
              hadethText:
                  "عن أنس بن مالك رضي الله عنه قال: (ما صليت وراء إمامٍ قط أخفَّ صلاة، ولا أتمَّ صلاةً من النبي ﷺ).",
              hadethNumber: 87,
              soundUrl: 'assets/sounds/87.ogg',
              explainUrl: 'https://youtu.be/fwN-JEK0MJc?si=WvnUSlrw4Afu4FU7',
            ),
            Hadeth(
              hadethText:
                  "عن أبي قلابة، عبد الله بن زيد الجرمي البصري قال: «جاءنا مالك بن الحويرث رضي الله عنه في مسجدنا هذا، فقال: إني لأصلي بكم وما أريد الصلاة، أصلي كيف رأيت رسول الله ﷺ يصلي».\n"
                  "فقلت لأبي قلابة: كيف كان يصلي؟\n"
                  "قال: مثل صلاة شيخنا هذا – وكان يجلس إذا رفع رأسه من السجود قبل أن ينهض –.\n"
                  "أراد شيبهم: أبا بريد عمرو بن سلمة الجرمي.",
              hadethNumber: 88,
              soundUrl: 'assets/sounds/88.ogg',
              explainUrl: 'https://youtu.be/cKDGDC5vVi8?si=tDLGmKd8tKPpNnEO',
            ),
            Hadeth(
              hadethText:
                  "عن عبد الله بن مالك بن بحينة رضي الله عنه: أن النبي ﷺ كان إذا صلى فرج بين يديه حتى يبدو بياض إبطيه.",
              hadethNumber: 89,
              soundUrl: 'assets/sounds/89.ogg',
              explainUrl: 'https://youtu.be/rQeFdzL1sDE?si=ghQ1CAcbFircyBbX',
            ),

            Hadeth(
              hadethText:
                  "عن أبي سلمة سعيد بن يزيد قال: (سألت أنس بن مالك رضي الله عنه: أكان النبي ﷺ يصلي في نعليه؟ قال: نعم).",
              hadethNumber: 90,
              soundUrl: 'assets/sounds/90.ogg',
              explainUrl: 'https://youtu.be/TVupLoBYV4w?si=TKQblML1FwKfp5-d',
            ),

            Hadeth(
              hadethText:
                  "عن أبي قتادة الأنصاري رضي الله عنه: أن رسول الله ﷺ كان يصلي وهو حامل أمامة بنت زينب بنت رسول الله ﷺ، ولأبي العاص بن الربيع بن عبد شمس، فإذا سجد وضعها، وإذا قام حملها.",
              hadethNumber: 91,
              soundUrl: 'assets/sounds/91.ogg',
              explainUrl: 'https://youtu.be/Yor6TFLTkUg?si=nOZNcfX8HjkbjlGA',
            ),
            Hadeth(
              hadethText:
                  "عن أنس بن مالك رضي الله عنه، عن النبي ﷺ قال: «اعْتَدِلوا في السجود، ولا يَبْسُط أحدكم ذراعيه انبساط الكلب».",
              hadethNumber: 92,
              soundUrl: 'assets/sounds/92.ogg',
              explainUrl: 'https://youtu.be/TjFditwM2-U?si=aOqJOoqnFjVYDt0z',
            ),
          ],
        ),
        Door(
          doorName: 'باب وجوب الطمأنينة في الركوع والسجود',
          hadeths: [
            Hadeth(
              hadethText:
                  "عن أبي هريرة رضي الله عنه: أن رسول الله ﷺ دخل المسجد، فدخل رجل فصلى، ثم جاء فسلَّم على النبي ﷺ، فقال له: ارجع فصلِّ فإنك لم تصلِّ. فرجع فصلى كما صلى، ثم جاء فسلَّم على النبي ﷺ، فقال: ارجع فصلِّ فإنك لم تصلِّ – ثلاثًا – فقال: والذي بعثك بالحق، ما أُحسن غير هذا، فعلِّمني. فقال: إذا قمت إلى الصلاة فكبِّر، ثم اقرأ ما تيسر معك من القرآن، ثم اركع حتى تطمئن راكعًا، ثم ارفع حتى تطمئن قائمًا، ثم اسجد حتى تطمئن ساجدًا، ثم ارفع حتى تطمئن جالسًا، ثم افعل ذلك في صلاتك كلها.",
              hadethNumber: 93,
              soundUrl: 'assets/sounds/93.ogg',
              explainUrl: 'https://youtu.be/fsgfHJOptMM?si=-2uaduK5DZqXF8Sc',
            ),
          ],
        ),
        Door(
          doorName: 'باب القرأة في الصلاة ',
          hadeths: [
            Hadeth(
              hadethText:
                  "عن عبادة بن الصامت رضي الله عنه: أن رسول الله ﷺ قال: «لا صلاة لمن لم يقرأ بفاتحة الكتاب».",
              hadethNumber: 94,
              soundUrl: 'assets/sounds/94.ogg',
              explainUrl: 'https://youtu.be/7htSF7iEUvE?si=MO-AHBxarH6lyoir',
            ),

            Hadeth(
              hadethText:
                  "عن أبي قتادة الأنصاري رضي الله عنه قال: (كان النبي ﷺ يقرأ في الركعتين الأوليين من صلاة الظهر بفاتحة الكتاب وسورتين، يطوِّل في الأولى ويقصِّر في الثانية، ويسمع الآية أحيانًا.\n"
                  "وكان يقرأ في العصر بفاتحة الكتاب وسورتين، يطوِّل في الأولى ويقصِّر في الثانية.\n"
                  "وكان يطوِّل في الركعة الأولى من صلاة الصبح ويقصِّر في الثانية).\n"
                  "وفي الركعتين الأخيرتين بأم الكتاب.",
              hadethNumber: 95,
              soundUrl: 'assets/sounds/95.ogg',
              explainUrl: 'https://youtu.be/YxPwG9LyTw8?si=d8SwzFtWDzsQ9G58',
            ),
            Hadeth(
              hadethText:
                  "عن جبير بن مطعم رضي الله عنه قال: (سمعت النبي ﷺ يقرأ في المغرب بالطور).",
              hadethNumber: 96,
              soundUrl: 'assets/sounds/96.ogg',
              explainUrl: 'https://youtu.be/TpKnA9uNoMI?si=Vgz3WiuzRkq_MrCW',
            ),

            Hadeth(
              hadethText:
                  "عن البراء بن عازب رضي الله عنه: أن النبي ﷺ كان في سفر، فصلى العشاء الآخرة، فقرأ في إحدى الركعتين بالتين والزيتون، فما سمعت أحدًا أحسن صوتًا أو قراءة منه.",
              hadethNumber: 97,
              soundUrl: 'assets/sounds/97.ogg',
              explainUrl: 'https://youtu.be/F_VzMyoXzVI?si=SB5GlMZtddx0L-5F',
            ),
            Hadeth(
              hadethText:
                  "عن عائشة رضي الله عنها: أن رسول الله ﷺ بعث رجلًا على سرية، فكان يقرأ لأصحابه في صلاتهم فيختم بـ (قل هو الله أحد). فلما رجعوا ذكروا ذلك لرسول الله ﷺ فقال: سلوه لأي شيء يصنع ذلك؟ فسألوه فقال: لأنها صفة الرحمن، فأنا أحب أن أقرأ بها. فقال رسول الله ﷺ: أخبروه أن الله تعالى يحبه.",
              hadethNumber: 98,
              soundUrl: 'assets/sounds/98.ogg',
              explainUrl: 'https://youtu.be/lDWbpHc391o?si=btih2UZAMSDXwNNt',
            ),

            Hadeth(
              hadethText:
                  "عن جابر بن عبد الله رضي الله عنهما: أن النبي ﷺ قال لمعاذ: (أفتان أنت يا معاذ؟) – حين قرأ بسورة طويلة في صلاة العشاء – وقال: (فلولا صليت بـ سبح اسم ربك الأعلى، والشمس وضحاها، والليل إذا يغشى، فإنه يصلي وراءك الكبير والضعيف وذو الحاجة).",
              hadethNumber: 99,
              soundUrl: 'assets/sounds/99.ogg',
              explainUrl: 'https://youtu.be/r7K4g4sHFn0?si=fdN7kqW5F4fxTqIj',
            ),
          ],
        ),
        Door(
          doorName: 'باب ترك الجهر بالبسملة',
          hadeths: [
            Hadeth(
              hadethText:
                  "عن أنس بن مالك رضي الله عنه: أن النبي ﷺ وأبا بكر وعمر رضي الله عنهما كانوا يفتتحون الصلاة بـ ﴿الحمد لله رب العالمين﴾.\n"
                  "وفي رواية: (صليت مع أبي بكر وعمر وعثمان رضي الله عنهم، فلم أسمع أحدًا منهم يقرأ بـ ﴿بسم الله الرحمن الرحيم﴾).\n"
                  "ولمسلم: (صليت خلف النبي ﷺ وأبي بكر وعمر وعثمان، فكانوا يستفتحون بـ ﴿الحمد لله رب العالمين﴾، لا يذكرون ﴿بسم الله الرحمن الرحيم﴾ في أول قراءة ولا في آخرها).",
              hadethNumber: 100,
              soundUrl: 'assets/sounds/100.ogg',
              explainUrl: 'https://youtu.be/ltxxkug_3Gs?si=Wlu8J14MrHVkp-86',
            ),
          ],
        ),
        Door(
          doorName: 'باب سجود السهو',
          hadeths: [
            Hadeth(
              hadethText:
                  "عن محمد بن سيرين، عن أبي هريرة رضي الله عنه قال: (صلى بنا رسول الله ﷺ إحدى صلاتي العشي – قال ابن سيرين: سماها أبو هريرة ولكن نسيت أنا – قال: فصلى بنا ركعتين ثم سلَّم، فقام إلى خشبة معروضة في المسجد، فاتكأ عليها كأنه غضبان، ووضع يده اليمنى على اليسرى، وشبك بين أصابعه. وخرجت السرعان من أبواب المسجد فقالوا: قُصرت الصلاة).\n"
                  "وفي القوم أبو بكر وعمر رضي الله عنهما فهابا أن يكلماه، وفي القوم رجل في يديه طول يقال له: ذو اليدين، فقال: يا رسول الله، أنسيت أم قَصرت الصلاة؟ قال: لم أنس ولم تُقصر.\n"
                  "فقال: أكما يقول ذو اليدين؟ قالوا: نعم. فتقدَّم فصلى ما تركه ثم سلم، ثم كبَّر وسجد مثل سجوده أو أطول، ثم رفع، ثم كبَّر وسجد مثل سجوده أو أطول، ثم رفع.\n"
                  "قال: فكان ذلك سهوًا). قال ابن سيرين: قال: نبئت أن عمران بن حصين قال: ثم سلم.",
              hadethNumber: 101,
              soundUrl: 'assets/sounds/101.ogg',
              explainUrl: 'https://youtu.be/8UjvovmI0QU?si=zRsmKQT68YPdsPgo',
            ),
            Hadeth(
              hadethText:
                  "عن عبد الله بن بحينة رضي الله عنه – وكان من أصحاب النبي ﷺ – أن النبي ﷺ صلى بهم الظهر، فقام في الركعتين الأوليين ولم يجلس، فقام الناس معه، حتى إذا قضى الصلاة وانتظر الناس تسليمه، كبَّر وهو جالس، فسجد سجدتين قبل أن يسلِّم، ثم سلَّم.",
              hadethNumber: 102,
              soundUrl: 'assets/sounds/102.ogg',
              explainUrl: 'https://youtu.be/csfr07RYr5s?si=VM6eAXBtalOYsZRB',
            ),
          ],
        ),
        Door(
          doorName: 'باب المررو بين يدين المصلي',
          hadeths: [
            Hadeth(
              hadethText:
                  "عن أبي جهيم بن الحارث بن الصمة الأنصاري رضي الله عنه قال: قال رسول الله ﷺ: «لو يعلم المار بين يدي المصلي ماذا عليه من الإثم، لكان أن يقف أربعين خيرًا له من أن يمر بين يديه». قال أبو النضر: لا أدري، قال: أربعين يومًا، أو شهرًا، أو سنةً.",
              hadethNumber: 103,
              soundUrl: 'assets/sounds/103.ogg',
              explainUrl: 'https://youtu.be/mHydE5kx1h8?si=VoAhiVfJFgdUUyrU',
            ),

            Hadeth(
              hadethText:
                  "عن أبي سعيد الخدري رضي الله عنه قال: سمعت النبي ﷺ يقول: «إذا صلى أحدكم إلى شيء يستره من الناس، فأراد أحد أن يجتاز بين يديه فليدفعه، فإن أبى فليقاتله، فإنما هو شيطان».",
              hadethNumber: 104,
              soundUrl: 'assets/sounds/104.ogg',
              explainUrl: 'https://youtu.be/vBe2j0jD0LM?si=g_dx_1rosISBXD9J',
            ),
            Hadeth(
              hadethText:
                  "عن عبد الله بن عباس رضي الله عنهما قال: أقبلتُ راكبًا على حمار أتان، وأنا يومئذ قد ناهزتُ الاحتلام، ورسول الله ﷺ يصلي بالناس بمنى إلى غير جدار، فمررت بين يدي بعض الصف، فنزلت، فأرسلت الأتان ترتع، فدخلت في الصف، فلم ينكر ذلك علي أحد.",
              hadethNumber: 105,
              soundUrl: 'assets/sounds/105.ogg',
              explainUrl: 'https://youtu.be/t2ch2Q1AvnM?si=nAt7d2B1JnOoy8gm',
            ),
            Hadeth(
              hadethText:
                  "عن عائشة رضي الله عنها قالت: «كنت أنام بين يدي رسول الله ﷺ ورجلاي في قبلته، فإذا سجد غمزني فقَبَضتُ رجلي، وإذا قام بسطتُهما، والبيوت يومئذ ليس فيها مصابيح».",
              hadethNumber: 106,
              soundUrl: 'assets/sounds/106.ogg',
              explainUrl: 'https://youtu.be/PHptyzLTUsY?si=ir4M2LT8xPfhH3Qd',
            ),
          ],
        ),
        Door(
          doorName: 'باب جامع',
          hadeths: [
            Hadeth(
              hadethText:
                  "عن أبي قتادة بن رِبعِي الأنصاري رضي الله عنه قال: قال النبي ﷺ: «إذا دخل أحدكم المسجد، فلا يجلس حتى يصلي ركعتين».",
              hadethNumber: 107,
              soundUrl: 'assets/sounds/107.ogg',
              explainUrl: 'https://youtu.be/SDWQyATGlQM?si=fNlNbmPwJZ-wr4E_',
            ),

            Hadeth(
              hadethText:
                  "عن زيد بن أرقم رضي الله عنه قال: كنا نتكلم في الصلاة، يكلم الرجل صاحبه وهو إلى جنبه في الصلاة، حتى نزلت ﴿وَقُومُوا لِلَّهِ قَانِتِينَ﴾، فأُمرنا بالسكوت ونهينا عن الكلام.",
              hadethNumber: 108,
              soundUrl: 'assets/sounds/108.ogg',
              explainUrl: 'https://youtu.be/LErkCj_ofCE?si=MKSB4PWYQNZU3go5',
            ),

            Hadeth(
              hadethText:
                  "عن عبد الله بن عمر رضي الله عنهما، عن رسول الله ﷺ أنه قال: «إذا اشتد الحر فأبردوا عن الصلاة؛ فإن شدة الحر من فيح جهنم».",
              hadethNumber: 109,
              soundUrl: 'assets/sounds/109.ogg',
              explainUrl: 'https://youtu.be/BgYC9xkWox8?si=LoIlG5qkFZSabmum',
            ),
            Hadeth(
              hadethText:
                  "عن أنس بن مالك رضي الله عنه، عن النبي ﷺ قال: «من نسي صلاة فليصلها إذا ذكرها، لا كفارة لها إلا ذلك: ﴿أقم الصلاة لذكري﴾».\n"
                  "ولمسلم: «من نسي صلاة أو نام عنها، فكفارتها أن يصليها إذا ذكرها».",
              hadethNumber: 110,
              soundUrl: 'assets/sounds/110.ogg',
              explainUrl: 'https://youtu.be/T5p2p6d6foc?si=q-gS-ObNWUe70jd5',
            ),
            Hadeth(
              hadethText:
                  "عن جابر بن عبد الله رضي الله عنهما: أن معاذ بن جبل رضي الله عنه كان يصلي مع رسول الله ﷺ عشاء الآخرة، ثم يرجع إلى قومه فيصلي بهم تلك الصلاة.",
              hadethNumber: 111,
              soundUrl: 'assets/sounds/111.ogg',
              explainUrl: 'https://youtu.be/AebbQgGxMNI?si=RxfsYIEP8v4oRVBk',
            ),

            Hadeth(
              hadethText:
                  "عن أنس بن مالك رضي الله عنه قال: (كنا نصلي مع رسول الله ﷺ في شدة الحر، فإذا لم يستطع أحدنا أن يمكن جبهته من الأرض بسط ثوبه فسجد عليه).",
              hadethNumber: 112,
              soundUrl: 'assets/sounds/112.ogg',
              explainUrl: 'https://youtu.be/V63TZEA-8wQ?si=G3-JZV-CT-hVcs-e',
            ),

            Hadeth(
              hadethText:
                  "عن أبي هريرة رضي الله عنه قال: قال رسول الله ﷺ: «لا يصلي أحدكم في الثوب الواحد ليس على عاتقه منه شيء».",
              hadethNumber: 113,
              soundUrl: 'assets/sounds/113.ogg',
              explainUrl: 'https://youtu.be/BkcNwn0sEPU?si=_-cZlkOg6b4u-Uav',
            ),
            Hadeth(
              hadethText:
                  "عن جابر بن عبد الله رضي الله عنهما، عن النبي ﷺ قال: «من أكل ثومًا أو بصلاً فليعتزلنا – أو قال: فليعتزل مسجدنا – وليقعد في بيته».\n"
                  "وأُتي بقدر فيه خضرات من بقول، فوجد لها ريحًا، فسأل فأُخبر بما فيها من البقول، فقال: قربوها – إلى بعض أصحابه – فقال: كل، فإني أناجي من لا تناجي.",
              hadethNumber: 114,
              soundUrl: 'assets/sounds/114.ogg',
              explainUrl: 'https://youtu.be/Tl1DIfgQXX8?si=h4O-ulnDX3TEZPpi',
            ),

            Hadeth(
              hadethText:
                  "عن جابر بن عبد الله رضي الله عنهما أن النبي ﷺ قال: «من أكل البصل والثوم والكراث فلا يقربن مسجدنا؛ فإن الملائكة تتأذى مما يتأذى منه بنو آدم».",
              hadethNumber: 115,
              soundUrl: 'assets/sounds/115.ogg',
              explainUrl: 'https://youtu.be/q2dcszr85LY?si=w2fjCJoQkuFlXitu',
            ),
          ],
        ),
        Door(
          doorName: 'باب التشهد',
          hadeths: [
            Hadeth(
              hadethText:
                  "عن عبد الله بن مسعود رضي الله عنه قال: «علَّمني رسول الله ﷺ التشهّد، كفّي بين كفّيه، كما يعلّمني السورة من القرآن:\n"
                  "التحيات لله، والصلوات، والطيبات، السلام عليك أيها النبي ورحمة الله وبركاته، السلام علينا وعلى عباد الله الصالحين، أشهد أن لا إله إلا الله، وأشهد أن محمدًا عبده ورسوله».\n\n"
                  "وفي لفظ: «إذا قعد أحدكم في الصلاة، فليقل: التحيات لله ...» وذكره.\n\n"
                  "وفيه: «فإنكم إذا فعلتم ذلك، فقد سلمتم على كل عبدٍ لله صالحٍ في السماء والأرض».\n\n"
                  "وفيه: «ثم ليتخيّر من المسألة ما شاء». ",
              hadethNumber: 116,
              soundUrl: 'assets/sounds/116.ogg',
              explainUrl: 'https://youtu.be/ZzZDa370zkQ?si=FQL3xyjOoowvSvil',
            ),
            Hadeth(
              hadethText:
                  "عن عبد الرحمن بن أبي ليلى قال: لقيَني كعب بن عُجرة رضي الله عنه فقال: ألا أهدي لك هديةً؟ إن النبي ﷺ خرج علينا فقلنا: يا رسول الله، قد علمنا كيف نسلِّم عليك، فكيف نصلِّي عليك؟\n"
                  "قال: قولوا: اللهم صلِّ على محمدٍ وعلى آل محمدٍ، كما صليت على آل إبراهيم، إنك حميد مجيد، اللهم بارك على محمدٍ وعلى آل محمدٍ، كما باركت على آل إبراهيم، إنك حميد مجيد.",
              hadethNumber: 117,
              soundUrl: 'assets/sounds/117.ogg',
              explainUrl: 'https://youtu.be/Tm3-BK7-w2A?si=4Qg23B12CulYs75f',
            ),

            Hadeth(
              hadethText:
                  "عن أبي هريرة رضي الله عنه قال: (كان رسول الله ﷺ يتعوذ بالله من عذاب القبر، ومن عذاب النار، ومن فتنة المحيا والممات، ومن فتنة المسيح الدجال).\n\n"
                  "وفي لفظ لمسلم: «إذا تشهّد أحدكم فليستعذ بالله من أربع، يقول: اللهم إني أعوذ بك من عذاب جهنم ...» ثم ذكر نحوه.",
              hadethNumber: 118,
              soundUrl: 'assets/sounds/118.ogg',
              explainUrl: 'https://youtu.be/ZcrB-jBmFZs?si=Aovr-oENczAPl2yt',
            ),
            Hadeth(
              hadethText:
                  "عن عبد الله بن عمرو بن العاص، عن أبي بكر الصديق رضي الله عنهما، أنه قال لرسول الله ﷺ: علّمني دعاءً أدعو به في صلاتي، قال: قل: «اللهم إني ظلمت نفسي ظلمًا كثيرًا، ولا يغفر الذنوب إلا أنت، فاغفر لي مغفرةً من عندك، وارحمني، إنك أنت الغفور الرحيم».",
              hadethNumber: 119,
              soundUrl: 'assets/sounds/119.ogg',
              explainUrl: 'https://youtu.be/Rlr_6UntfBY?si=emhGAxInzZ5Z2nVh',
            ),

            Hadeth(
              hadethText:
                  "عن عائشة رضي الله عنها قالت: (ما صلى النبي ﷺ صلاةً بعد أن نزلت عليه ﴿إذا جاء نصر الله والفتح﴾ إلا يقول فيها: سبحانك ربنا وبحمدك، اللهم اغفر لي).\n"
                  "وفي لفظ: (كان رسول الله ﷺ يكثر أن يقول في ركوعه وسجوده: سبحانك اللهم ربنا وبحمدك، اللهم اغفر لي).",
              hadethNumber: 120,
              soundUrl: 'assets/sounds/120.ogg',
              explainUrl: 'https://youtu.be/8PgTz4KDU6s?si=zIDixpVkWRkV0MNv',
            ),
          ],
        ),
        Door(
          doorName: 'باب الوتر',
          hadeths: [
            Hadeth(
              hadethText:
                  "عن عبد الله بن عمر رضي الله عنهما قال: (سأل رجلٌ النبي ﷺ وهو على المنبر: ما ترى في صلاة الليل؟ قال: مثنى مثنى، فإذا خشي أحدكم الصبح صلى واحدةً، فأوترت له ما صلى).\n"
                  "وإنه كان يقول: «اجعلوا آخر صلاتكم بالليل وترًا».",
              hadethNumber: 121,
              soundUrl: 'assets/sounds/121.ogg',
              explainUrl: 'https://youtu.be/TD4VMO6nauA?si=-madTBDlg86Lv0KK',
            ),

            Hadeth(
              hadethText:
                  "عن عائشة رضي الله عنها قالت: (من كل الليل قد أوتر رسول الله ﷺ، من أوله وأوسطه وآخره، فانتهى وتره إلى السحر).",
              hadethNumber: 122,
              soundUrl: 'assets/sounds/122.ogg',
              explainUrl: 'https://youtu.be/vDj1bCOyJb8?si=Ra9mhilJeySl3bsg',
            ),

            Hadeth(
              hadethText:
                  "عن عائشة رضي الله عنها قالت: (كان رسول الله ﷺ يصلي من الليل ثلاث عشرة ركعة، يوتر من ذلك بخمس، لا يجلس في شيء إلا في آخرها).",
              hadethNumber: 123,
              soundUrl: 'assets/sounds/123.ogg',
              explainUrl: 'https://youtu.be/DoNFM0I-YQM?si=vQcaoiWxFrnr59ra',
            ),
          ],
        ),
        Door(
          doorName: 'باب الذكر عقيب الصلاة',
          hadeths: [
            Hadeth(
              hadethText:
                  "عن عبد الله بن عباس رضي الله عنهما: أن رفع الصوت بالذكر حين ينصرف الناس من المكتوبة، كان على عهد رسول الله ﷺ.\n"
                  "قال ابن عباس رضي الله عنهما: كنت أعلم إذا انصرفوا بذلك إذا سمعته.\n"
                  "وفي لفظ: (ما كنا نعرف انقضاء صلاة رسول الله ﷺ إلا بالتكبير).",
              hadethNumber: 124,
              soundUrl: 'assets/sounds/124.ogg',
              explainUrl: 'https://youtu.be/M3OSxvRxCes?si=tMCphl6axfIikBgs',
            ),
            Hadeth(
              hadethText:
                  "عن وِراد – مولى المغيرة بن شعبة – قال: أملى علي المغيرة بن شعبة في كتاب إلى معاوية رضي الله عنه: أن النبي ﷺ كان يقول في دبر كل صلاة مكتوبة:\n"
                  "لا إله إلا الله وحده لا شريك له، له الملك وله الحمد، وهو على كل شيء قدير.\n"
                  "اللهم لا مانع لما أعطيت، ولا معطي لما منعت، ولا ينفع ذا الجد منك الجد.\n"
                  "ثم وُفدت بعد على معاوية فسمعته يأمر الناس بذلك.\n"
                  "وفي لفظ: (وكان ينهى عن قيل وقال، وإضاعة المال، وكثرة السؤال، وكان ينهى عن عقوق الأمهات، ووأد البنات، ومنع وهات).",
              hadethNumber: 125,
              soundUrl: 'assets/sounds/125.ogg',
              explainUrl: 'https://youtu.be/CycWXDSxJno?si=zYFoeNhNyE8TauvW',
            ),
            Hadeth(
              hadethText:
                  "عن سمى – مولى أبي بكر بن عبد الرحمن بن الحارث بن هشام – عن أبي صالح السمان، عن أبي هريرة رضي الله عنه: أن فقراء المهاجرين أتوا رسول الله ﷺ فقالوا: قد ذهب أهل الدثور بالدرجات العلا، والنعيم المقيم. فقال: وما ذاك؟ قالوا: يصلون كما نصلي، ويصومون كما نصوم، ويتصدقون ولا نتصدق، ويعتقون ولا نعتق.\n\n"
                  "فقال رسول الله ﷺ: «ألا أعلمكم شيئًا تدركون به من سبقكم، وتسبقون به من بعدكم، ولا يكون أحد أفضل منكم إلا من صنع مثل ما صنعتم؟» قالوا: بلى يا رسول الله. قال: «تسبحون وتكبرون وتحمدون دبر كل صلاة ثلاثًا وثلاثين مرة».\n\n"
                  "قال أبو صالح: فرجع فقراء المهاجرين فقالوا: سمع إخواننا أهل الأموال بما فعلنا ففعلوا مثله. فقال رسول الله ﷺ: «ذلك فضل الله يؤتيه من يشاء».\n\n"
                  "قال سُمي: فحدثت بعض أهلي هذا الحديث، فقال: وهمت، إنما قال لك: تسبح الله ثلاثًا وثلاثين، وتحمد الله ثلاثًا وثلاثين، وتكبر الله ثلاثًا وثلاثين، حتى تبلغ من جميعهن ثلاثًا وثلاثين.",
              hadethNumber: 126,
              soundUrl: 'assets/sounds/126.ogg',
              explainUrl: 'https://youtu.be/ZqvKEJZlCug?si=e6UYkj7rvbrdw9dw',
            ),

            Hadeth(
              hadethText:
                  "عن عائشة رضي الله عنها: أن النبي ﷺ صلى في خميصة لها أعلام، فنظر إلى أعلامها نظرة، فلما انصرف قال: اذهبوا بخميصتي هذه إلى أبي جهم، وأتوني بأنبجانية أبي جهم، فإنها ألهتني آنفًا عن صلاتي.",
              hadethNumber: 127,
              soundUrl: 'assets/sounds/127.ogg',
              explainUrl: 'https://youtu.be/6sesAQkrViI?si=PPKV_704i8j3yfpw',
            ),
          ],
        ),
        Door(
          doorName: 'باب الجمع بين الصلاتين في السفر',
          hadeths: [
            Hadeth(
              hadethText:
                  "عن عبد الله بن عباس رضي الله عنهما قال: «كان رسول الله ﷺ يجمع بين صلاة الظهر والعصر إذا كان على ظهر سير، ويجمع بين المغرب والعشاء».",
              hadethNumber: 128,
              soundUrl: 'assets/sounds/128.ogg',
              explainUrl: 'https://youtu.be/aQosvM04_xs?si=ozL3utO8ZPy4Qhnz',
            ),
          ],
        ),
        Door(
          doorName: 'باب قصر الصلاة في السفر',
          hadeths: [
            Hadeth(
              hadethText:
                  "عن عبد الله بن عمر رضي الله عنهما قال: «صحبت رسول الله ﷺ، فكان لا يزيد في السفر على ركعتين، وأبا بكر وعمر وعثمان كذلك».\n\n"
                  "هذا هو لفظ رواية البخاري في الحديث.\n"
                  "وفي لفظ رواية مسلم: «أكثر وأزيد». ",
              hadethNumber: 129,
              soundUrl: 'assets/sounds/129.ogg',
              explainUrl: 'https://youtu.be/jjH39RYRptw?si=EChVgFkJeWLbk9_C',
            ),
          ],
        ),
        Door(
          doorName: 'باب الجمعة',
          hadeths: [
            Hadeth(
              hadethText:
                  "عن سهل بن سعد الساعدي رضي الله عنه قال: (رأيت رسول الله ﷺ قام عليه، فكبر وكبر الناس وراءه، وهو على المنبر، ثم رفع، فنزل القهقري حتى سجد في أصل المنبر، ثم عاد حتى فرغ من آخر صلاته، ثم أقبل على الناس فقال: أيها الناس، إنما صنعت هذا لتأتموا بي، ولتتعلموا صلاتي).\n\n"
                  "وفي لفظ: (صلى عليها، ثم كبر عليها، ثم ركع وهو عليها، ثم نزل القهقري).",
              hadethNumber: 130,
              soundUrl: 'assets/sounds/130.ogg',
              explainUrl: 'https://youtu.be/4gQMT5Ouq50?si=Yq3RHYYI9oZIPItl',
            ),

            Hadeth(
              hadethText:
                  "عن عبد الله بن عمر رضي الله عنهما: أن رسول الله ﷺ قال: «من جاء منكم الجمعة فليغتسل».",
              hadethNumber: 131,
              soundUrl: 'assets/sounds/131.ogg',
              explainUrl: 'https://youtu.be/dpa8y0p1kYA?si=V0xif1NxQZOEVab4',
            ),

            Hadeth(
              hadethText:
                  "وعنه رضي الله عنه قال: (كان النبي ﷺ يخطب خطبتين، وهو قائم، يفصل بينهما بجلوس).",
              hadethNumber: 132,
              soundUrl: 'assets/sounds/132.ogg',
              explainUrl: 'https://youtu.be/4xFnNuMmrtk?si=6OhLlDXwKNJecbZK',
            ),
            Hadeth(
              hadethText:
                  "عن جابر بن عبد الله رضي الله عنه قال: (جاء رجل والنبي ﷺ يخطب الناس يوم الجمعة، فقال: صليت يا فلان؟ قال: لا. قال: قم فاركع ركعتين). وفي رواية: (فصل ركعتين).",
              hadethNumber: 133,
              soundUrl: 'assets/sounds/133.ogg',
              explainUrl: 'https://youtu.be/oYdMHkq2nCA?si=csxOyvWRhajzyjVT',
            ),

            Hadeth(
              hadethText:
                  "عن أبي هريرة رضي الله عنه: أن رسول الله ﷺ قال: «إذا قلتَ لصاحبك: أنصت يوم الجمعة والإمام يخطب، فقد لغوت».",
              hadethNumber: 134,
              soundUrl: 'assets/sounds/134.ogg',
              explainUrl: 'https://youtu.be/2MQ5NfMZVwI?si=qx_Su0Py_H8FbhQT',
            ),

            Hadeth(
              hadethText:
                  "وعنه رضي الله عنه أن رسول الله ﷺ قال: «من اغتسل يوم الجمعة ثم راح، فكأنما قرب بدنة، ومن راح في الساعة الثانية فكأنما قرب بقرة، ومن راح في الساعة الثالثة فكأنما قرب كبشًا أقرن، ومن راح في الساعة الرابعة فكأنما قرب دجاجة، ومن راح في الساعة الخامسة فكأنما قرب بيضة، فإذا خرج الإمام حضرت الملائكة يستمعون الذكر».",
              hadethNumber: 135,
              soundUrl: 'assets/sounds/135.ogg',
              explainUrl: 'https://youtu.be/0-NPgyM7_yU?si=3iB2OrFHP6pGfXR2',
            ),
            Hadeth(
              hadethText:
                  "عن سلمة بن الأكوع رضي الله عنه – وكان من أصحاب الشجرة – قال: (كنا نصلي مع النبي ﷺ الجمعة، ثم ننصرف وليس للحيطان ظل نستظل به).\n"
                  "وفي لفظ: (كنا نجمع مع رسول الله ﷺ إذا زالت الشمس، ثم نرجع نتتبع الفيء).",
              hadethNumber: 136,
              soundUrl: 'assets/sounds/136.ogg',
              explainUrl: 'https://youtu.be/PbOMg8QEmyo?si=mGB0qf9mS7elrRcD',
            ),

            Hadeth(
              hadethText:
                  "عن أبي هريرة رضي الله عنه قال: (كان النبي ﷺ يقرأ في صلاة الفجر يوم الجمعة: ﴿الم تنزيل﴾ السجدة، و ﴿هل أتى على الإنسان﴾).",
              hadethNumber: 137,
              soundUrl: 'assets/sounds/137.ogg',
              explainUrl: 'https://youtu.be/JAb8vwAwPm4?si=twgE0TzjOcQGPi58',
            ),
          ],
        ),
        Door(
          doorName: 'باب العيدين',
          hadeths: [
            Hadeth(
              hadethText:
                  "عن عبد الله بن عمر رضي الله عنهما قال: «كان النبي ﷺ وأبو بكر وعمر رضي الله عنهما يصلون العيدين قبل الخطبة».",
              hadethNumber: 138,
              soundUrl: 'assets/sounds/138.ogg',
              explainUrl: 'https://youtu.be/61cRs08OAgo?si=enVLZHKy3ieq3t7W',
            ),
            Hadeth(
              hadethText:
                  "عن البراء بن عازب رضي الله عنه قال: «خطبنا النبي ﷺ يوم الأضحى بعد الصلاة، فقال: من صلى صلاتنا ونسك نسكنا فقد أصاب النسك، ومن نسك قبل الصلاة فلا نسك له».\n\n"
                  "فقال أبو بردة بن نيار – خال البراء بن عازب رضي الله عنه –: يا رسول الله، إني نسكت شاتي قبل الصلاة، وعرفت أن اليوم يوم أكل وشرب، وأحببت أن تكون شاتي أول ما يذبح في بيتي، فذبحت شاتي وتغديت قبل أن آتي الصلاة. فقال: شاتك شاة لحم.\n\n"
                  "قال: يا رسول الله، فإن عندي عناقًا هي أحب إلي من شاتين، أفتجزئ عني؟ قال: نعم، ولن تجزئ عن أحد بعدك.",
              hadethNumber: 139,
              soundUrl: 'assets/sounds/139.ogg',
              explainUrl: 'https://youtu.be/p8An0oZrq1E?si=khaMoWIIVgByouKr',
            ),
            Hadeth(
              hadethText:
                  "عن جندب بن عبد الله البجلي رضي الله عنه قال: «صلى النبي ﷺ يوم النحر، ثم خطب، ثم ذبح، وقال: من ذبح قبل أن يصلي، فليذبح أخرى مكانها، ومن لم يذبح، فليذبح باسم الله».",
              hadethNumber: 140,
              soundUrl: 'assets/sounds/140.ogg',
              explainUrl: 'https://youtu.be/dRZKg699MnM?si=LW5S3gqRGuKJPi0O',
            ),
            Hadeth(
              hadethText:
                  "عن جابر رضي الله عنه قال: «شهدت مع النبي ﷺ يوم العيد، فبدأ بالصلاة قبل الخطبة بلا أذان ولا إقامة، ثم قام متوكئًا على بلال، فأمر بتقوى الله، وحث على طاعته، ووعظ الناس وذكرهم، ثم مضى حتى أتى النساء فوعظهن وذكرهن، وقال: تصدقن؛ فإنكن أكثر حطب جهنم».\n\n"
                  "فقامت امرأة من سِطَة النساء سفعاء الخدين، فقالت: لِمَ يا رسول الله؟!\n"
                  "قال: «لأنكن تكثرن الشكاة، وتكفرن العشير». قال: فجعلن يتصدقن من حليهن، يلقين في ثوب بلال من أقرطتهن وخواتمهن.",
              hadethNumber: 141,
              soundUrl: 'assets/sounds/141.ogg',
              explainUrl: 'https://youtu.be/GQGEbSsYz9I?si=jgHqhv57QZplMTtK',
            ),
            Hadeth(
              hadethText:
                  "عن أم عطية نسيبة الأنصارية رضي الله عنها قالت: «أمرنا – تعني النبي ﷺ – أن نخرج في العيدين العواتق وذوات الخدور، وأمر الحيض أن يعتزلن مصلى المسلمين».\n\n"
                  "وفي لفظ: «كنا نؤمر أن نخرج يوم العيد، حتى نخرج البكر من خدرها، حتى تخرج الحيض، فيكن خلف الناس، فيكبرن بتكبيرهم، ويدعون بدعائهم، يرجون بركة ذلك اليوم وطهرته».",
              hadethNumber: 142,
              soundUrl: 'assets/sounds/142.ogg',
              explainUrl: 'https://youtu.be/cnJZqsJc7lA?si=aetVoNvOOgtGUBUH',
            ),
          ],
        ),
        Door(
          doorName: 'باب صلاة الكسوف',
          hadeths: [
            Hadeth(
              hadethText:
                  "عن عائشة رضي الله عنها: أن الشمس خسفت على عهد رسول الله ﷺ، فبعث مناديًا ينادي: الصلاة جامعة، فاجتمعوا، وتقدم فكبر، وصلى أربع ركعات في ركعتين، وأربع سجدات.",
              hadethNumber: 143,
              soundUrl: 'assets/sounds/143.ogg',
              explainUrl: 'https://youtu.be/1fN_BdwCaFQ?si=Qvyk_ZXOkuOMNov1',
            ),

            Hadeth(
              hadethText:
                  "عن أبي مسعود عقبة بن عمرو الأنصاري البدري رضي الله عنه قال: قال رسول الله ﷺ: «إن الشمس والقمر آيتان من آيات الله، يخوف الله بهما عباده، وإنهما لا ينكسفان لموت أحد من الناس، فإذا رأيتم منها شيئًا فصلوا وادعوا حتى ينكشف ما بكم».",
              hadethNumber: 144,
              soundUrl: 'assets/sounds/144.ogg',
              explainUrl: 'https://youtu.be/03Rzy5GNPpA?si=6Okx7oJjbDAgS1AH',
            ),
            Hadeth(
              hadethText:
                  "عن عائشة رضي الله عنها قالت: «خسفت الشمس في عهد رسول الله ﷺ، فصلى رسول الله ﷺ بالناس، فاطال القيام، ثم ركع فأطال الركوع، ثم قام فأطال القيام – وهو دون القيام الأول –، ثم ركع فأطال الركوع – وهو دون الركوع الأول –، ثم سجد فأطال السجود، ثم فعل في الركعة الأخرى مثل ما فعل في الركعة الأولى، ثم انصرف وقد تجلت الشمس، فخطب الناس، فحمد الله وأثنى عليه، ثم قال: إن الشمس والقمر آيتان من آيات الله، لا يخسفان لموت أحد ولا لحياته، فإذا رأيتم ذلك فادعوا الله، وكبروا، وصلوا، وتصدقوا».\n\n"
                  "ثم قال: «يا أمة محمد! والله! ما من أحد أغير من الله أن يزني عبده، أو تزني أمته. يا أمة محمد! والله! لو تعلمون ما أعلم لضحكتم قليلًا ولبكيتم كثيرًا».\n\n"
                  "وفي لفظ: «فأستكمل أربع ركعات وأربع سجدات».",
              hadethNumber: 145,
              soundUrl: 'assets/sounds/145.ogg',
              explainUrl: 'https://youtu.be/2EZOfjSVbhA?si=fHRUtEJFfXB7xNk0',
            ),
            Hadeth(
              hadethText:
                  "عن أبي موسى رضي الله عنه قال: «خسفت الشمس في زمن رسول الله ﷺ، فقام فزعًا يخشى أن تكون الساعة، حتى أتى المسجد، فقام فصلى بأطول قيام وركوع وسجود، ما رأيته يفعله في صلاة قط. ثم قال: إن هذه الآيات التي يرسلها الله لا تكون لموت أحد ولا لحياته، ولكن الله ﷺ يرسلها يخوف بها عباده، فإذا رأيتم منها شيئًا فافزعوا إلى ذكره، ودعائه، واستغفاره».",
              hadethNumber: 146,
              soundUrl: 'assets/sounds/146.ogg',
              explainUrl: 'https://youtu.be/1zWVdpDOjy4?si=Dz-RlSGun-VpgHs7',
            ),
          ],
        ),
        Door(
          doorName: 'باب الاستسقاء',
          hadeths: [
            Hadeth(
              hadethText:
                  "عن عبد الله بن زيد بن عاصم المازني رضي الله عنه قال: «خرج النبي ﷺ يستسقي، فتوجه إلى القبلة يدعو، وحول رداءه، ثم صلى ركعتين، جهر فيهما بالقراءة». وفي لفظ: «إلى المصلى».",
              hadethNumber: 147,
              soundUrl: 'assets/sounds/147.ogg',
              explainUrl: 'https://youtu.be/aRpdR0xCZeY?si=nQg2juRxheHHnqdf',
            ),
            Hadeth(
              hadethText:
                  "عن أنس بن مالك رضي الله عنه: أن رجلًا دخل المسجد يوم الجمعة من باب كان نحو دار القضاء، ورسول الله ﷺ قائم يخطب، فاستقبل رسول الله ﷺ قائمًا، ثم قال: يا رسول الله! هلكت الأموال، وانقطعت السبل، فادع الله يغيثنا. قال: فرفع رسول الله ﷺ يديه ثم قال: اللهم أغثنا! اللهم أغثنا! اللهم أغثنا! قال أنس: ولا والله ما نرى في السماء من سحاب ولا قزعة، وما بيننا وبين سلع من بيت ولا دار. قال: فطلعت من ورائه سحابة مثل الترس، فلما توسطت السماء انتشرت ثم أمطرت. قال: فلا والله ما رأينا الشمس سبتًا.\n\n"
                  "قال: ثم دخل رجل من ذلك الباب في الجمعة المقبلة، ورسول الله ﷺ قائم يخطب، فاستقبله قائمًا، فقال: يا رسول الله! هلكت الأموال، وانقطعت السبل، فادع الله يمسكها عنا. قال: فرفع رسول الله ﷺ يديه ثم قال: اللهم حوالينا ولا علينا، اللهم على الآكام والظراب وبطون الأودية ومنابت الشجر. قال: فأقلعت، وخرجنا نمشي في الشمس.\n\n"
                  "قال شريك: فسألت أنس بن مالك: أهو الرجل الأول؟ قال: لا أدري. والظراب: الجبال الصغار.",
              hadethNumber: 148,
              soundUrl: 'assets/sounds/148.ogg',
              explainUrl: 'https://youtu.be/xj0vZHOc7lQ?si=KdLVy-DRto7dVxZD',
            ),
          ],
        ),
        Door(
          doorName: 'باب صلاة الخوف',
          hadeths: [
            Hadeth(
              hadethText:
                  "عن عبد الله بن عمر بن الخطاب رضي الله عنهما قال: «صلى رسول الله ﷺ صلاة الخوف في بعض أيامه، فقامت طائفة معه، وطائفة بإزاء العدو، فصلى بالذين معه ركعة، ثم ذهبوا، وجاء الآخرون فصلى بهم ركعة، وقضت الطائفتان ركعة ركعة».",
              hadethNumber: 149,
              soundUrl: 'assets/sounds/149.ogg',
              explainUrl: 'https://youtu.be/5fkJBe64efQ?si=StgqEQls_T-VMGV8',
            ),
            Hadeth(
              hadethText:
                  "عن يزيد بن رومان، عن صالح بن خوات بن جبير، عمّن صلى مع رسول الله ﷺ صلاة ذات الرقاع؛ صلاة الخوف: «أن طائفة صفت معه، وطائفة وجاه العدو، فصلى بالذين معه ركعة، ثم ثبت قائمًا، وأتموا لأنفسهم، ثم انصرفوا فصفوا وجاه العدو، وجاءت الطائفة الأخرى، فصلى بهم الركعة التي بقيت، ثم ثبت جالسًا، وأتموا لأنفسهم، ثم سلم بهم». قال: الذي صلى مع رسول الله ﷺ هو سهل بن أبي حثمة.",
              hadethNumber: 150,
              soundUrl: 'assets/sounds/150.ogg',
              explainUrl: 'https://youtu.be/t_cldZfHd6o?si=xKd4jkghvSbtVZlo',
            ),
            Hadeth(
              hadethText:
                  "عن جابر بن عبد الله الأنصاري رضي الله عنه قال: «شهدت مع رسول الله ﷺ صلاة الخوف، فصففنا صفين خلف رسول الله ﷺ، والعدو بيننا وبين القبلة، فكبر النبي ﷺ وكبرنا جميعًا، ثم ركع وركعنا جميعًا، ثم رفع رأسه من الركوع ورفعنا جميعًا، ثم انحدر بالسجود والصف الذي يليه، وقام الصف المؤخر في نحر العدو، فلما قضى النبي ﷺ السجود، قام الصف الذي يليه، فانحدر الصف المؤخر بالسجود، وقاموا. ثم تقدم الصف المؤخر وتأخر الصف المقدم. ثم ركع النبي ﷺ وركعنا جميعًا، ثم رفع رأسه من الركوع ورفعنا جميعًا. ثم انحدر بالسجود والصف الذي يليه، والصف المؤخر الذي كان مؤخرًا في الركعة الأولى، فقام الصف المؤخر في نحر العدو، فلما قضى النبي ﷺ السجود والصف الذي يليه، انحدر الصف المؤخر بالسجود، فسجدوا. ثم سلم النبي ﷺ وسلمنا جميعًا». قال جابر: كما يصنع حرسكم هؤلاء بأمرائهم. ذكره مسلم بتمامه. وذكر البخاري طرفًا منه: «وأنه صلى صلاة الخوف مع النبي ﷺ في الغزوة السابعة، غزوة ذات الرقاع».",
              hadethNumber: 151,
              soundUrl: 'assets/sounds/151.ogg',
              explainUrl: 'https://youtu.be/v6lCrmaTtzo?si=JP27h8JljFRYTTmx',
            ),
          ],
        ),
      ],
    ),
  ];
}
